<abi-corpus architecture='elf-intel-80386' soname='libssl.so.1.1'>
  <elf-needed>
    <dependency name='libcrypto.so.1.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='BIO_f_ssl' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_buffer_ssl_connect' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_ssl' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_ssl_connect' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_ssl_copy_session_id' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_ssl_shutdown' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='SSL_use_cert_and_key' version='OPENSSL_1_1_1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_certificate' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_certificate_ASN1' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_certificate_chain_file' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_certificate_file' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_psk_identity_hint' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_verify_client_post_handshake' version='OPENSSL_1_1_1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_version' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_waiting_for_async' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_want' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write_early_data' version='OPENSSL_1_1_1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write_ex' version='OPENSSL_1_1_1' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_client_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_server_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_client_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_server_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_client_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_server_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_client_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_server_method' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='d2i_SSL_SESSION' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='i2d_SSL_SESSION' version='OPENSSL_1_1_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='32' path='stack_chk_fail_local.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/glibc-2.33/debug' language='LANG_C11'>
    <function-decl name='__stack_chk_fail' filepath='/home/abuild/rpmbuild/BUILD/glibc-2.33/debug/stack_chk_fail_local.c' line='37' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='32' path='&lt;artificial&gt;-1a3f3' comp-dir-path='/usr/src/debug/openssl-1_1-1.1.1k-2.12.i386' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='288' id='type-id-3'>
      <subrange length='9' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <typedef-decl name='SSL_CONF_CTX' type-id='type-id-6' filepath='include/openssl/ssl.h' line='225' column='1' id='type-id-7'/>
    <class-decl name='ssl_conf_ctx_st' size-in-bits='704' is-struct='yes' visibility='default' filepath='ssl/ssl_conf.c' line='73' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='ssl/ssl_conf.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='prefix' type-id='type-id-2' visibility='default' filepath='ssl/ssl_conf.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefixlen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_conf.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ctx' type-id='type-id-9' visibility='default' filepath='ssl/ssl_conf.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ssl' type-id='type-id-10' visibility='default' filepath='ssl/ssl_conf.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='poptions' type-id='type-id-11' visibility='default' filepath='ssl/ssl_conf.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cert_filename' type-id='type-id-3' visibility='default' filepath='ssl/ssl_conf.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='pcert_flags' type-id='type-id-11' visibility='default' filepath='ssl/ssl_conf.c' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pvfy_flags' type-id='type-id-11' visibility='default' filepath='ssl/ssl_conf.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='min_version' type-id='type-id-12' visibility='default' filepath='ssl/ssl_conf.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='max_version' type-id='type-id-12' visibility='default' filepath='ssl/ssl_conf.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='tbl' type-id='type-id-13' visibility='default' filepath='ssl/ssl_conf.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ntbl' type-id='type-id-8' visibility='default' filepath='ssl/ssl_conf.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='canames' type-id='type-id-14' visibility='default' filepath='ssl/ssl_conf.c' line='102' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssl_flag_tbl' type-id='type-id-15' filepath='ssl/ssl_conf.c' line='27' column='1' id='type-id-16'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-16' visibility='default' filepath='ssl/ssl_conf.c' line='22' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='ssl/ssl_conf.c' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='namelen' type-id='type-id-18' visibility='default' filepath='ssl/ssl_conf.c' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name_flags' type-id='type-id-4' visibility='default' filepath='ssl/ssl_conf.c' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='option_value' type-id='type-id-19' visibility='default' filepath='ssl/ssl_conf.c' line='26' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='32' id='type-id-20'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='32' id='type-id-21'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='32' id='type-id-22'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='32' id='type-id-25'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='32' id='type-id-28'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='32' id='type-id-13'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='32' id='type-id-32'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='32' id='type-id-11'/>
    <function-decl name='i2d_SSL_SESSION' mangled-name='i2d_SSL_SESSION' filepath='ssl/ssl_asn1.c' line='104' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='i2d_SSL_SESSION@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-34' name='in' filepath='ssl/ssl_asn1.c' line='104' column='1'/>
      <parameter type-id='type-id-35' name='pp' filepath='ssl/ssl_asn1.c' line='104' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_ex_data_X509_STORE_CTX_idx' mangled-name='SSL_get_ex_data_X509_STORE_CTX_idx' filepath='ssl/ssl_cert.c' line='43' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_ex_data_X509_STORE_CTX_idx@@OPENSSL_1_1_0'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_dup_CA_list' mangled-name='SSL_dup_CA_list' filepath='ssl/ssl_cert.c' line='456' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_dup_CA_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-32' name='sk' filepath='ssl/ssl_cert.c' line='456' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='SSL_set0_CA_list' mangled-name='SSL_set0_CA_list' filepath='ssl/ssl_cert.c' line='480' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set0_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_cert.c' line='480' column='1'/>
      <parameter type-id='type-id-14' name='name_list' filepath='ssl/ssl_cert.c' line='480' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set0_CA_list' mangled-name='SSL_CTX_set0_CA_list' filepath='ssl/ssl_cert.c' line='485' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set0_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_cert.c' line='485' column='1'/>
      <parameter type-id='type-id-14' name='name_list' filepath='ssl/ssl_cert.c' line='485' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_get0_CA_list' mangled-name='SSL_CTX_get0_CA_list' filepath='ssl/ssl_cert.c' line='490' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get0_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_cert.c' line='490' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='SSL_get0_CA_list' mangled-name='SSL_get0_CA_list' filepath='ssl/ssl_cert.c' line='495' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_cert.c' line='495' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_client_CA_list' mangled-name='SSL_CTX_set_client_CA_list' filepath='ssl/ssl_cert.c' line='500' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_client_CA_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_cert.c' line='500' column='1'/>
      <parameter type-id='type-id-14' name='name_list' filepath='ssl/ssl_cert.c' line='500' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_client_CA_list' mangled-name='SSL_CTX_get_client_CA_list' filepath='ssl/ssl_cert.c' line='505' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_client_CA_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_cert.c' line='505' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='SSL_set_client_CA_list' mangled-name='SSL_set_client_CA_list' filepath='ssl/ssl_cert.c' line='510' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_client_CA_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_cert.c' line='510' column='1'/>
      <parameter type-id='type-id-14' name='name_list' filepath='ssl/ssl_cert.c' line='510' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get0_peer_CA_list' mangled-name='SSL_get0_peer_CA_list' filepath='ssl/ssl_cert.c' line='515' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_peer_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_cert.c' line='515' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='SSL_get_client_CA_list' mangled-name='SSL_get_client_CA_list' filepath='ssl/ssl_cert.c' line='520' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_client_CA_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_cert.c' line='520' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='SSL_add1_to_CA_list' mangled-name='SSL_add1_to_CA_list' filepath='ssl/ssl_cert.c' line='547' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_add1_to_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_cert.c' line='547' column='1'/>
      <parameter type-id='type-id-28' name='x' filepath='ssl/ssl_cert.c' line='547' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_add1_to_CA_list' mangled-name='SSL_CTX_add1_to_CA_list' filepath='ssl/ssl_cert.c' line='552' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_add1_to_CA_list@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_cert.c' line='552' column='1'/>
      <parameter type-id='type-id-28' name='x' filepath='ssl/ssl_cert.c' line='552' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_add_client_CA' mangled-name='SSL_add_client_CA' filepath='ssl/ssl_cert.c' line='561' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_add_client_CA@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_cert.c' line='561' column='1'/>
      <parameter type-id='type-id-38' name='x' filepath='ssl/ssl_cert.c' line='561' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_add_client_CA' mangled-name='SSL_CTX_add_client_CA' filepath='ssl/ssl_cert.c' line='566' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_add_client_CA@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_cert.c' line='566' column='1'/>
      <parameter type-id='type-id-38' name='x' filepath='ssl/ssl_cert.c' line='566' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_load_client_CA_file' mangled-name='SSL_load_client_CA_file' filepath='ssl/ssl_cert.c' line='605' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_load_client_CA_file@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-17' name='file' filepath='ssl/ssl_cert.c' line='605' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='SSL_add_file_cert_subjects_to_stack' mangled-name='SSL_add_file_cert_subjects_to_stack' filepath='ssl/ssl_cert.c' line='662' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_add_file_cert_subjects_to_stack@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-14' name='stack' filepath='ssl/ssl_cert.c' line='662' column='1'/>
      <parameter type-id='type-id-17' name='file' filepath='ssl/ssl_cert.c' line='663' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_add_dir_cert_subjects_to_stack' mangled-name='SSL_add_dir_cert_subjects_to_stack' filepath='ssl/ssl_cert.c' line='712' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_add_dir_cert_subjects_to_stack@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-14' name='stack' filepath='ssl/ssl_cert.c' line='712' column='1'/>
      <parameter type-id='type-id-17' name='dir' filepath='ssl/ssl_cert.c' line='713' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_ciphersuites' mangled-name='SSL_CTX_set_ciphersuites' filepath='ssl/ssl_ciph.c' line='1383' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_ciphersuites@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_ciph.c' line='1383' column='1'/>
      <parameter type-id='type-id-17' name='str' filepath='ssl/ssl_ciph.c' line='1383' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_description' mangled-name='SSL_CIPHER_description' filepath='ssl/ssl_ciph.c' line='1718' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_description@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='cipher' filepath='ssl/ssl_ciph.c' line='1718' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='ssl/ssl_ciph.c' line='1718' column='1'/>
      <parameter type-id='type-id-18' name='len' filepath='ssl/ssl_ciph.c' line='1718' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_version' mangled-name='SSL_CIPHER_get_version' filepath='ssl/ssl_ciph.c' line='1918' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_version@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1918' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_name' mangled-name='SSL_CIPHER_get_name' filepath='ssl/ssl_ciph.c' line='1933' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_name@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1933' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_standard_name' mangled-name='SSL_CIPHER_standard_name' filepath='ssl/ssl_ciph.c' line='1941' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_standard_name@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1941' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='OPENSSL_cipher_name' mangled-name='OPENSSL_cipher_name' filepath='ssl/ssl_ciph.c' line='1949' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='OPENSSL_cipher_name@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-17' name='stdname' filepath='ssl/ssl_ciph.c' line='1949' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_bits' mangled-name='SSL_CIPHER_get_bits' filepath='ssl/ssl_ciph.c' line='1960' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_bits@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1960' column='1'/>
      <parameter type-id='type-id-12' name='alg_bits' filepath='ssl/ssl_ciph.c' line='1960' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_id' mangled-name='SSL_CIPHER_get_id' filepath='ssl/ssl_ciph.c' line='1972' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_id@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1972' column='1'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_protocol_id' mangled-name='SSL_CIPHER_get_protocol_id' filepath='ssl/ssl_ciph.c' line='1977' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_protocol_id@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='1977' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='SSL_COMP_get_compression_methods' mangled-name='SSL_COMP_get_compression_methods' filepath='ssl/ssl_ciph.c' line='2016' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_get_compression_methods@@OPENSSL_1_1_0'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='SSL_COMP_set0_compression_methods' mangled-name='SSL_COMP_set0_compression_methods' filepath='ssl/ssl_ciph.c' line='2022' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_set0_compression_methods@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-41' name='meths' filepath='ssl/ssl_ciph.c' line='2023' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='SSL_COMP_add_compression_method' mangled-name='SSL_COMP_add_compression_method' filepath='ssl/ssl_ciph.c' line='2042' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_add_compression_method@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-18' name='id' filepath='ssl/ssl_ciph.c' line='2042' column='1'/>
      <parameter type-id='type-id-42' name='cm' filepath='ssl/ssl_ciph.c' line='2042' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_COMP_get_name' mangled-name='SSL_COMP_get_name' filepath='ssl/ssl_ciph.c' line='2092' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_get_name@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-25' name='comp' filepath='ssl/ssl_ciph.c' line='2092' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_COMP_get0_name' mangled-name='SSL_COMP_get0_name' filepath='ssl/ssl_ciph.c' line='2101' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_get0_name@@OPENSSL_1_1_0d'>
      <parameter type-id='type-id-43' name='comp' filepath='ssl/ssl_ciph.c' line='2101' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_COMP_get_id' mangled-name='SSL_COMP_get_id' filepath='ssl/ssl_ciph.c' line='2110' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_COMP_get_id@@OPENSSL_1_1_0d'>
      <parameter type-id='type-id-43' name='comp' filepath='ssl/ssl_ciph.c' line='2110' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_find' mangled-name='SSL_CIPHER_find' filepath='ssl/ssl_ciph.c' line='2129' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_find@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_ciph.c' line='2129' column='1'/>
      <parameter type-id='type-id-44' name='ptr' filepath='ssl/ssl_ciph.c' line='2129' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_cipher_nid' mangled-name='SSL_CIPHER_get_cipher_nid' filepath='ssl/ssl_ciph.c' line='2134' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_cipher_nid@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2134' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_digest_nid' mangled-name='SSL_CIPHER_get_digest_nid' filepath='ssl/ssl_ciph.c' line='2145' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_digest_nid@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2145' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_kx_nid' mangled-name='SSL_CIPHER_get_kx_nid' filepath='ssl/ssl_ciph.c' line='2154' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_kx_nid@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2154' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_auth_nid' mangled-name='SSL_CIPHER_get_auth_nid' filepath='ssl/ssl_ciph.c' line='2163' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_auth_nid@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2163' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_get_handshake_digest' mangled-name='SSL_CIPHER_get_handshake_digest' filepath='ssl/ssl_ciph.c' line='2172' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_get_handshake_digest@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2172' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='SSL_CIPHER_is_aead' mangled-name='SSL_CIPHER_is_aead' filepath='ssl/ssl_ciph.c' line='2181' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CIPHER_is_aead@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-39' name='c' filepath='ssl/ssl_ciph.c' line='2181' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_cmd' mangled-name='SSL_CONF_cmd' filepath='ssl/ssl_conf.c' line='799' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_cmd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='799' column='1'/>
      <parameter type-id='type-id-17' name='cmd' filepath='ssl/ssl_conf.c' line='799' column='1'/>
      <parameter type-id='type-id-17' name='value' filepath='ssl/ssl_conf.c' line='799' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_cmd_argv' mangled-name='SSL_CONF_cmd_argv' filepath='ssl/ssl_conf.c' line='839' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_cmd_argv@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='839' column='1'/>
      <parameter type-id='type-id-12' name='pargc' filepath='ssl/ssl_conf.c' line='839' column='1'/>
      <parameter type-id='type-id-22' name='pargv' filepath='ssl/ssl_conf.c' line='839' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_cmd_value_type' mangled-name='SSL_CONF_cmd_value_type' filepath='ssl/ssl_conf.c' line='872' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_cmd_value_type@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='872' column='1'/>
      <parameter type-id='type-id-17' name='cmd' filepath='ssl/ssl_conf.c' line='872' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_new' mangled-name='SSL_CONF_CTX_new' filepath='ssl/ssl_conf.c' line='883' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_new@@OPENSSL_1_1_0'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_free' mangled-name='SSL_CONF_CTX_free' filepath='ssl/ssl_conf.c' line='923' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_free@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='923' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_set_flags' mangled-name='SSL_CONF_CTX_set_flags' filepath='ssl/ssl_conf.c' line='935' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_set_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='935' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='ssl/ssl_conf.c' line='935' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_clear_flags' mangled-name='SSL_CONF_CTX_clear_flags' filepath='ssl/ssl_conf.c' line='941' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_clear_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='941' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='ssl/ssl_conf.c' line='941' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_set1_prefix' mangled-name='SSL_CONF_CTX_set1_prefix' filepath='ssl/ssl_conf.c' line='947' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_set1_prefix@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='947' column='1'/>
      <parameter type-id='type-id-17' name='pre' filepath='ssl/ssl_conf.c' line='947' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_set_ssl' mangled-name='SSL_CONF_CTX_set_ssl' filepath='ssl/ssl_conf.c' line='964' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_set_ssl@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='964' column='1'/>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_conf.c' line='964' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_set_ssl_ctx' mangled-name='SSL_CONF_CTX_set_ssl_ctx' filepath='ssl/ssl_conf.c' line='983' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_set_ssl_ctx@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='983' column='1'/>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_conf.c' line='983' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ERR_load_SSL_strings' mangled-name='ERR_load_SSL_strings' filepath='ssl/ssl_err.c' line='1268' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='ERR_load_SSL_strings@@OPENSSL_1_1_0'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='d2i_SSL_SESSION' mangled-name='d2i_SSL_SESSION' filepath='ssl/ssl_asn1.c' line='239' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='d2i_SSL_SESSION@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-46' name='a' filepath='ssl/ssl_asn1.c' line='239' column='1'/>
      <parameter type-id='type-id-47' name='pp' filepath='ssl/ssl_asn1.c' line='239' column='1'/>
      <parameter type-id='type-id-48' name='length' filepath='ssl/ssl_asn1.c' line='240' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='SSL_set_ciphersuites' mangled-name='SSL_set_ciphersuites' filepath='ssl/ssl_ciph.c' line='1394' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_ciphersuites@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_ciph.c' line='1394' column='1'/>
      <parameter type-id='type-id-17' name='str' filepath='ssl/ssl_ciph.c' line='1394' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CONF_CTX_finish' mangled-name='SSL_CONF_CTX_finish' filepath='ssl/ssl_conf.c' line='890' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CONF_CTX_finish@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-20' name='cctx' filepath='ssl/ssl_conf.c' line='890' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='32' id='type-id-42'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='32' id='type-id-10'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='32' id='type-id-9'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='32' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='32' id='type-id-46'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='32' id='type-id-38'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='32' id='type-id-2'/>
    <class-decl name='stack_st_X509_NAME' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-30'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='32' id='type-id-45'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='32' id='type-id-37'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='32' id='type-id-39'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='32' id='type-id-43'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='32' id='type-id-36'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='32' id='type-id-17'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='32' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='32' id='type-id-47'/>
    <type-decl name='int' size-in-bits='32' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='32' id='type-id-12'/>
    <type-decl name='long int' size-in-bits='32' id='type-id-48'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='32' id='type-id-41'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='32' id='type-id-14'/>
    <typedef-decl name='COMP_METHOD' type-id='type-id-61' filepath='include/openssl/ossl_typ.h' line='154' column='1' id='type-id-23'/>
    <typedef-decl name='X509' type-id='type-id-62' filepath='include/openssl/ossl_typ.h' line='123' column='1' id='type-id-26'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/i586-suse-linux/11/include/stddef.h' line='209' column='1' id='type-id-8'/>
    <typedef-decl name='uint16_t' type-id='type-id-63' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-40'/>
    <typedef-decl name='uint32_t' type-id='type-id-64' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-33'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='32' id='type-id-35'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='unsigned long int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='char' size-in-bits='8' id='type-id-52'/>
    <class-decl name='comp_method_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-61'/>
    <class-decl name='stack_st_SSL_COMP' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-60'/>
    <class-decl name='x509_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-62'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-53'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-54'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-55'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-56'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-57'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-58'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-59'/>
    <typedef-decl name='SSL' type-id='type-id-70' filepath='include/openssl/ossl_typ.h' line='150' column='1' id='type-id-49'/>
    <typedef-decl name='SSL_CTX' type-id='type-id-71' filepath='include/openssl/ossl_typ.h' line='151' column='1' id='type-id-50'/>
    <typedef-decl name='SSL_SESSION' type-id='type-id-72' filepath='include/openssl/ssl.h' line='223' column='1' id='type-id-51'/>
    <typedef-decl name='__uint16_t' type-id='type-id-73' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-63'/>
    <typedef-decl name='__uint32_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-64'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='32' id='type-id-65'/>
    <class-decl name='ssl_ctx_st' size-in-bits='4736' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='735' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='method' type-id='type-id-74' visibility='default' filepath='ssl/ssl_local.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cipher_list' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cipher_list_by_id' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='739' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls13_ciphersuites' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cert_store' type-id='type-id-76' visibility='default' filepath='ssl/ssl_local.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sessions' type-id='type-id-77' visibility='default' filepath='ssl/ssl_local.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='session_cache_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='session_cache_head' type-id='type-id-78' visibility='default' filepath='ssl/ssl_local.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='session_cache_tail' type-id='type-id-78' visibility='default' filepath='ssl/ssl_local.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='session_cache_mode' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='756' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='session_timeout' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='new_session_cb' type-id='type-id-79' visibility='default' filepath='ssl/ssl_local.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='remove_session_cb' type-id='type-id-80' visibility='default' filepath='ssl/ssl_local.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='get_session_cb' type-id='type-id-81' visibility='default' filepath='ssl/ssl_local.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='stats' type-id='type-id-82' visibility='default' filepath='ssl/ssl_local.h' line='795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='app_verify_callback' type-id='type-id-83' visibility='default' filepath='ssl/ssl_local.h' line='800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='app_verify_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='default_passwd_callback' type-id='type-id-85' visibility='default' filepath='ssl/ssl_local.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='default_passwd_callback_userdata' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='client_cert_cb' type-id='type-id-86' visibility='default' filepath='ssl/ssl_local.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='app_gen_cookie_cb' type-id='type-id-87' visibility='default' filepath='ssl/ssl_local.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='app_verify_cookie_cb' type-id='type-id-88' visibility='default' filepath='ssl/ssl_local.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='gen_stateless_cookie_cb' type-id='type-id-89' visibility='default' filepath='ssl/ssl_local.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='verify_stateless_cookie_cb' type-id='type-id-90' visibility='default' filepath='ssl/ssl_local.h' line='829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='ex_data' type-id='type-id-91' visibility='default' filepath='ssl/ssl_local.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='md5' type-id='type-id-45' visibility='default' filepath='ssl/ssl_local.h' line='834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='sha1' type-id='type-id-45' visibility='default' filepath='ssl/ssl_local.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='extra_certs' type-id='type-id-92' visibility='default' filepath='ssl/ssl_local.h' line='837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='comp_methods' type-id='type-id-41' visibility='default' filepath='ssl/ssl_local.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='info_callback' type-id='type-id-93' visibility='default' filepath='ssl/ssl_local.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='ca_names' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='client_ca_names' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='options' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='mode' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='min_proto_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='max_proto_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='max_cert_list' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='cert' type-id='type-id-94' visibility='default' filepath='ssl/ssl_local.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='read_ahead' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='msg_callback' type-id='type-id-95' visibility='default' filepath='ssl/ssl_local.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='msg_callback_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='verify_mode' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='sid_ctx' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='default_verify_callback' type-id='type-id-97' visibility='default' filepath='ssl/ssl_local.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='generate_session_id' type-id='type-id-98' visibility='default' filepath='ssl/ssl_local.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='param' type-id='type-id-99' visibility='default' filepath='ssl/ssl_local.h' line='882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='quiet_shutdown' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='884' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='ctlog_store' type-id='type-id-100' visibility='default' filepath='ssl/ssl_local.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='ct_validation_callback' type-id='type-id-101' visibility='default' filepath='ssl/ssl_local.h' line='892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='ct_validation_callback_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='split_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='max_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='max_pipelines' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='default_read_buf_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='client_cert_engine' type-id='type-id-102' visibility='default' filepath='ssl/ssl_local.h' line='917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='client_hello_cb' type-id='type-id-103' visibility='default' filepath='ssl/ssl_local.h' line='921' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='client_hello_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='922' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='ext' type-id='type-id-104' visibility='default' filepath='ssl/ssl_local.h' line='1001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='psk_client_callback' type-id='type-id-105' visibility='default' filepath='ssl/ssl_local.h' line='1004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='psk_server_callback' type-id='type-id-106' visibility='default' filepath='ssl/ssl_local.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='psk_find_session_cb' type-id='type-id-107' visibility='default' filepath='ssl/ssl_local.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='psk_use_session_cb' type-id='type-id-108' visibility='default' filepath='ssl/ssl_local.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='srp_ctx' type-id='type-id-109' visibility='default' filepath='ssl/ssl_local.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='dane' type-id='type-id-110' visibility='default' filepath='ssl/ssl_local.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='srtp_profiles' type-id='type-id-111' visibility='default' filepath='ssl/ssl_local.h' line='1019' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='not_resumable_session_cb' type-id='type-id-112' visibility='default' filepath='ssl/ssl_local.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='lock' type-id='type-id-113' visibility='default' filepath='ssl/ssl_local.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='keylog_callback' type-id='type-id-114' visibility='default' filepath='ssl/ssl_local.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='max_early_data' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='recv_max_early_data' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='record_padding_cb' type-id='type-id-115' visibility='default' filepath='ssl/ssl_local.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='record_padding_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='block_padding' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='generate_ticket_cb' type-id='type-id-116' visibility='default' filepath='ssl/ssl_local.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='decrypt_ticket_cb' type-id='type-id-117' visibility='default' filepath='ssl/ssl_local.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='ticket_cb_data' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='num_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='allow_early_data_cb' type-id='type-id-118' visibility='default' filepath='ssl/ssl_local.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='allow_early_data_cb_data' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='pha_enabled' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1065' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_session_st' size-in-bits='4128' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='506' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ssl_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='master_key_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='early_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='master_key' type-id='type-id-120' visibility='default' filepath='ssl/ssl_local.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='session_id_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='session_id' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='sid_ctx' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='psk_identity_hint' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='psk_identity' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='not_resumable' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='peer' type-id='type-id-38' visibility='default' filepath='ssl/ssl_local.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='peer_chain' type-id='type-id-92' visibility='default' filepath='ssl/ssl_local.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='verify_result' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='timeout' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='time' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='compress_meth' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='cipher' type-id='type-id-39' visibility='default' filepath='ssl/ssl_local.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='cipher_id' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='ex_data' type-id='type-id-91' visibility='default' filepath='ssl/ssl_local.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='prev' type-id='type-id-78' visibility='default' filepath='ssl/ssl_local.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='next' type-id='type-id-78' visibility='default' filepath='ssl/ssl_local.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='ext' type-id='type-id-121' visibility='default' filepath='ssl/ssl_local.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='srp_username' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='ticket_appdata' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='ticket_appdata_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='flags' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='lock' type-id='type-id-113' visibility='default' filepath='ssl/ssl_local.h' line='588' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_st' size-in-bits='31840' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1068' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='method' type-id='type-id-74' visibility='default' filepath='ssl/ssl_local.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbio' type-id='type-id-122' visibility='default' filepath='ssl/ssl_local.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='wbio' type-id='type-id-122' visibility='default' filepath='ssl/ssl_local.h' line='1083' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bbio' type-id='type-id-122' visibility='default' filepath='ssl/ssl_local.h' line='1085' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rwstate' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='handshake_func' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='server' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='new_session' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='quiet_shutdown' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='shutdown' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='statem' type-id='type-id-124' visibility='default' filepath='ssl/ssl_local.h' line='1114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='early_data_state' type-id='type-id-125' visibility='default' filepath='ssl/ssl_local.h' line='1115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='init_buf' type-id='type-id-126' visibility='default' filepath='ssl/ssl_local.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='init_msg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='init_num' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='init_off' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='s3' type-id='type-id-127' visibility='default' filepath='ssl/ssl_local.h' line='1121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='d1' type-id='type-id-128' visibility='default' filepath='ssl/ssl_local.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='msg_callback' type-id='type-id-95' visibility='default' filepath='ssl/ssl_local.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='msg_callback_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='hit' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='param' type-id='type-id-99' visibility='default' filepath='ssl/ssl_local.h' line='1128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='dane' type-id='type-id-129' visibility='default' filepath='ssl/ssl_local.h' line='1130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='peer_ciphers' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='1132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='cipher_list' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='1133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='cipher_list_by_id' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='tls13_ciphersuites' type-id='type-id-75' visibility='default' filepath='ssl/ssl_local.h' line='1136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='mac_flags' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='early_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='handshake_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='master_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='resumption_master_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='client_finished_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='server_finished_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='server_finished_hash' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='handshake_traffic_hash' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='client_app_traffic_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='server_app_traffic_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='exporter_master_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='early_exporter_master_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7776'>
        <var-decl name='enc_read_ctx' type-id='type-id-130' visibility='default' filepath='ssl/ssl_local.h' line='1157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='read_iv' type-id='type-id-131' visibility='default' filepath='ssl/ssl_local.h' line='1158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='read_hash' type-id='type-id-132' visibility='default' filepath='ssl/ssl_local.h' line='1159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7968'>
        <var-decl name='compress' type-id='type-id-133' visibility='default' filepath='ssl/ssl_local.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='expand' type-id='type-id-133' visibility='default' filepath='ssl/ssl_local.h' line='1161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8032'>
        <var-decl name='enc_write_ctx' type-id='type-id-130' visibility='default' filepath='ssl/ssl_local.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='write_iv' type-id='type-id-131' visibility='default' filepath='ssl/ssl_local.h' line='1163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='write_hash' type-id='type-id-132' visibility='default' filepath='ssl/ssl_local.h' line='1164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='cert' type-id='type-id-94' visibility='default' filepath='ssl/ssl_local.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='cert_verify_hash' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='cert_verify_hash_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='hello_retry_request' type-id='type-id-134' visibility='default' filepath='ssl/ssl_local.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8864'>
        <var-decl name='sid_ctx' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='1186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9120'>
        <var-decl name='session' type-id='type-id-34' visibility='default' filepath='ssl/ssl_local.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='psksession' type-id='type-id-34' visibility='default' filepath='ssl/ssl_local.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9184'>
        <var-decl name='psksession_id' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='psksession_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9248'>
        <var-decl name='generate_session_id' type-id='type-id-98' visibility='default' filepath='ssl/ssl_local.h' line='1194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='tmp_session_id' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='tmp_session_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9568'>
        <var-decl name='verify_mode' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='verify_callback' type-id='type-id-97' visibility='default' filepath='ssl/ssl_local.h' line='1208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9632'>
        <var-decl name='info_callback' type-id='type-id-93' visibility='default' filepath='ssl/ssl_local.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='error' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9696'>
        <var-decl name='error_code' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='psk_client_callback' type-id='type-id-105' visibility='default' filepath='ssl/ssl_local.h' line='1216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9760'>
        <var-decl name='psk_server_callback' type-id='type-id-106' visibility='default' filepath='ssl/ssl_local.h' line='1217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='psk_find_session_cb' type-id='type-id-107' visibility='default' filepath='ssl/ssl_local.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9824'>
        <var-decl name='psk_use_session_cb' type-id='type-id-108' visibility='default' filepath='ssl/ssl_local.h' line='1220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='ctx' type-id='type-id-9' visibility='default' filepath='ssl/ssl_local.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9888'>
        <var-decl name='verified_chain' type-id='type-id-92' visibility='default' filepath='ssl/ssl_local.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='verify_result' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='1225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9952'>
        <var-decl name='ex_data' type-id='type-id-91' visibility='default' filepath='ssl/ssl_local.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='ca_names' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10016'>
        <var-decl name='client_ca_names' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10080'>
        <var-decl name='options' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='mode' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10144'>
        <var-decl name='min_proto_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='max_proto_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10208'>
        <var-decl name='max_cert_list' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='first_packet' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10272'>
        <var-decl name='client_version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='split_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10336'>
        <var-decl name='max_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='max_pipelines' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10400'>
        <var-decl name='ext' type-id='type-id-135' visibility='default' filepath='ssl/ssl_local.h' line='1367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11840'>
        <var-decl name='clienthello' type-id='type-id-136' visibility='default' filepath='ssl/ssl_local.h' line='1373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11872'>
        <var-decl name='servername_done' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11904'>
        <var-decl name='ct_validation_callback' type-id='type-id-101' visibility='default' filepath='ssl/ssl_local.h' line='1387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11936'>
        <var-decl name='ct_validation_callback_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='scts' type-id='type-id-137' visibility='default' filepath='ssl/ssl_local.h' line='1394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12000'>
        <var-decl name='scts_parsed' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12032'>
        <var-decl name='session_ctx' type-id='type-id-9' visibility='default' filepath='ssl/ssl_local.h' line='1398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12064'>
        <var-decl name='srtp_profiles' type-id='type-id-111' visibility='default' filepath='ssl/ssl_local.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12096'>
        <var-decl name='srtp_profile' type-id='type-id-138' visibility='default' filepath='ssl/ssl_local.h' line='1403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12128'>
        <var-decl name='renegotiate' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12160'>
        <var-decl name='key_update' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12192'>
        <var-decl name='post_handshake_auth' type-id='type-id-139' visibility='default' filepath='ssl/ssl_local.h' line='1414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12224'>
        <var-decl name='pha_enabled' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12256'>
        <var-decl name='pha_context' type-id='type-id-140' visibility='default' filepath='ssl/ssl_local.h' line='1416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='pha_context_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12320'>
        <var-decl name='certreqs_sent' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12352'>
        <var-decl name='pha_dgst' type-id='type-id-132' visibility='default' filepath='ssl/ssl_local.h' line='1419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12384'>
        <var-decl name='srp_ctx' type-id='type-id-109' visibility='default' filepath='ssl/ssl_local.h' line='1423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12896'>
        <var-decl name='not_resumable_session_cb' type-id='type-id-112' visibility='default' filepath='ssl/ssl_local.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12928'>
        <var-decl name='rlayer' type-id='type-id-141' visibility='default' filepath='ssl/ssl_local.h' line='1430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31200'>
        <var-decl name='default_passwd_callback' type-id='type-id-85' visibility='default' filepath='ssl/ssl_local.h' line='1432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31232'>
        <var-decl name='default_passwd_callback_userdata' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31264'>
        <var-decl name='job' type-id='type-id-142' visibility='default' filepath='ssl/ssl_local.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31296'>
        <var-decl name='waitctx' type-id='type-id-143' visibility='default' filepath='ssl/ssl_local.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31328'>
        <var-decl name='asyncrw' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31360'>
        <var-decl name='max_early_data' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31392'>
        <var-decl name='recv_max_early_data' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31424'>
        <var-decl name='early_data_count' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31456'>
        <var-decl name='record_padding_cb' type-id='type-id-115' visibility='default' filepath='ssl/ssl_local.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31488'>
        <var-decl name='record_padding_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31520'>
        <var-decl name='block_padding' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31552'>
        <var-decl name='lock' type-id='type-id-113' visibility='default' filepath='ssl/ssl_local.h' line='1463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31584'>
        <var-decl name='num_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31616'>
        <var-decl name='sent_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31648'>
        <var-decl name='next_ticket_nonce' type-id='type-id-144' visibility='default' filepath='ssl/ssl_local.h' line='1470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31712'>
        <var-decl name='allow_early_data_cb' type-id='type-id-118' visibility='default' filepath='ssl/ssl_local.h' line='1473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31744'>
        <var-decl name='allow_early_data_cb_data' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31776'>
        <var-decl name='shared_sigalgs' type-id='type-id-145' visibility='default' filepath='ssl/ssl_local.h' line='1480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31808'>
        <var-decl name='shared_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1481' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='EVP_MD' type-id='type-id-146' filepath='include/openssl/ossl_typ.h' line='91' column='1' id='type-id-66'/>
    <typedef-decl name='SSL_CIPHER' type-id='type-id-147' filepath='include/openssl/ssl.h' line='222' column='1' id='type-id-67'/>
    <typedef-decl name='SSL_COMP' type-id='type-id-148' filepath='include/openssl/ssl.h' line='226' column='1' id='type-id-68'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-69'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-73'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='32' id='type-id-142'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='32' id='type-id-143'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='32' id='type-id-122'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='32' id='type-id-126'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='32' id='type-id-136'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='32' id='type-id-133'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='32' id='type-id-113'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='32' id='type-id-100'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='32' id='type-id-102'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='32' id='type-id-130'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='32' id='type-id-132'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='32' id='type-id-138'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='32' id='type-id-81'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='32' id='type-id-99'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='32' id='type-id-94'/>
    <class-decl name='dane_ctx_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='56' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mdevp' type-id='type-id-164' visibility='default' filepath='include/internal/dane.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mdord' type-id='type-id-140' visibility='default' filepath='include/internal/dane.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mdmax' type-id='type-id-165' visibility='default' filepath='include/internal/dane.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='include/internal/dane.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='evp_md_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-146'/>
    <class-decl name='ssl_cipher_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='414' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='valid' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stdname' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='id' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='algorithm_mkey' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='algorithm_auth' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='algorithm_enc' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='algorithm_mac' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_tls' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_tls' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='min_dtls' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_dtls' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='algo_strength' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='algorithm2' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strength_bits' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='alg_bits' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_comp_st' size-in-bits='96' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='653' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='method' type-id='type-id-42' visibility='default' filepath='ssl/ssl_local.h' line='656' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='288' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='561' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostname' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tick' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ticklen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tick_lifetime_hint' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tick_age_add' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='max_early_data' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alpn_selected' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='alpn_selected_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-165' visibility='default' filepath='ssl/ssl_local.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='1024' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='925' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='servername_cb' type-id='type-id-167' visibility='default' filepath='ssl/ssl_local.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='servername_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tick_key_name' type-id='type-id-131' visibility='default' filepath='ssl/ssl_local.h' line='930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secure' type-id='type-id-168' visibility='default' filepath='ssl/ssl_local.h' line='931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ticket_key_cb' type-id='type-id-169' visibility='default' filepath='ssl/ssl_local.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status_cb' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='status_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='status_type' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-165' visibility='default' filepath='ssl/ssl_local.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='ecpointformats' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='supportedgroups' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='alpn_select_cb' type-id='type-id-172' visibility='default' filepath='ssl/ssl_local.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='alpn_select_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='alpn' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='alpn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='npn_advertised_cb' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='npn_advertised_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='npn_select_cb' type-id='type-id-174' visibility='default' filepath='ssl/ssl_local.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='npn_select_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='cookie_hmac_key' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='1000' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='1440' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1263' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extflags' type-id='type-id-175' visibility='default' filepath='ssl/ssl_local.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='debug_cb' type-id='type-id-176' visibility='default' filepath='ssl/ssl_local.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='debug_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='hostname' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='status_type' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='scts' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='scts_len' type-id='type-id-40' visibility='default' filepath='ssl/ssl_local.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='status_expected' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ocsp' type-id='type-id-177' visibility='default' filepath='ssl/ssl_local.h' line='1288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ticket_expected' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ecpointformats' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='peer_ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='peer_ecpointformats' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='supportedgroups' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='peer_supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='peer_supportedgroups' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='session_ticket' type-id='type-id-178' visibility='default' filepath='ssl/ssl_local.h' line='1310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='session_ticket_cb' type-id='type-id-179' visibility='default' filepath='ssl/ssl_local.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='session_ticket_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='session_secret_cb' type-id='type-id-180' visibility='default' filepath='ssl/ssl_local.h' line='1315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='session_secret_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='alpn' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='alpn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='npn' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='npn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='psk_kex_mode' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='use_etm' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='early_data' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='early_data_ok' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tls13_cookie' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='tls13_cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='cookieok' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-165' visibility='default' filepath='ssl/ssl_local.h' line='1359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tick_identity' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='777' column='1' id='type-id-82'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='32' id='type-id-74'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='32' id='type-id-145'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='32' id='type-id-128'/>
    <enum-decl name='__anonymous_enum__9' is-anonymous='yes' filepath='ssl/ssl_local.h' line='1178' column='1' id='type-id-134'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='SSL_HRR_NONE' value='0'/>
      <enumerator name='SSL_HRR_PENDING' value='1'/>
      <enumerator name='SSL_HRR_COMPLETE' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='32' id='type-id-123'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='32' id='type-id-86'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='32' id='type-id-90'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='32' id='type-id-88'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='32' id='type-id-112'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='32' id='type-id-89'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='32' id='type-id-87'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='32' id='type-id-83'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='32' id='type-id-97'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='32' id='type-id-79'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='32' id='type-id-77'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='32' id='type-id-85'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='32' id='type-id-127'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='32' id='type-id-78'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='32' id='type-id-137'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='32' id='type-id-111'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='32' id='type-id-75'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='32' id='type-id-92'/>
    <typedef-decl name='CRYPTO_EX_DATA' type-id='type-id-202' filepath='include/openssl/ossl_typ.h' line='166' column='1' id='type-id-91'/>
    <typedef-decl name='GEN_SESSION_CB' type-id='type-id-87' filepath='include/openssl/ssl.h' line='679' column='1' id='type-id-98'/>
    <typedef-decl name='OSSL_STATEM' type-id='type-id-203' filepath='ssl/statem/statem.h' line='122' column='1' id='type-id-124'/>
    <typedef-decl name='RECORD_LAYER' type-id='type-id-204' filepath='ssl/record/record.h' line='170' column='1' id='type-id-141'/>
    <typedef-decl name='SRP_CTX' type-id='type-id-205' filepath='ssl/ssl_local.h' line='611' column='1' id='type-id-109'/>
    <typedef-decl name='SSL_CTX_decrypt_session_ticket_fn' type-id='type-id-206' filepath='include/openssl/ssl.h' line='2418' column='1' id='type-id-117'/>
    <typedef-decl name='SSL_CTX_generate_session_ticket_fn' type-id='type-id-170' filepath='include/openssl/ssl.h' line='2417' column='1' id='type-id-116'/>
    <typedef-decl name='SSL_CTX_keylog_cb_func' type-id='type-id-207' filepath='include/openssl/ssl.h' line='926' column='1' id='type-id-114'/>
    <typedef-decl name='SSL_DANE' type-id='type-id-208' filepath='include/openssl/ossl_typ.h' line='122' column='1' id='type-id-129'/>
    <typedef-decl name='SSL_EARLY_DATA_STATE' type-id='type-id-209' filepath='ssl/ssl_local.h' line='629' column='1' id='type-id-125'/>
    <typedef-decl name='SSL_PHA_STATE' type-id='type-id-210' filepath='ssl/ssl_local.h' line='409' column='1' id='type-id-139'/>
    <typedef-decl name='SSL_allow_early_data_cb_fn' type-id='type-id-170' filepath='include/openssl/ssl.h' line='2437' column='1' id='type-id-118'/>
    <typedef-decl name='SSL_client_hello_cb_fn' type-id='type-id-167' filepath='include/openssl/ssl.h' line='1810' column='1' id='type-id-103'/>
    <typedef-decl name='SSL_psk_client_cb_func' type-id='type-id-211' filepath='include/openssl/ssl.h' line='833' column='1' id='type-id-105'/>
    <typedef-decl name='SSL_psk_find_session_cb_func' type-id='type-id-212' filepath='include/openssl/ssl.h' line='855' column='1' id='type-id-107'/>
    <typedef-decl name='SSL_psk_server_cb_func' type-id='type-id-213' filepath='include/openssl/ssl.h' line='842' column='1' id='type-id-106'/>
    <typedef-decl name='SSL_psk_use_session_cb_func' type-id='type-id-214' filepath='include/openssl/ssl.h' line='859' column='1' id='type-id-108'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='32' id='type-id-115'/>
    <typedef-decl name='ssl_ct_validation_cb' type-id='type-id-216' filepath='include/openssl/ssl.h' line='2191' column='1' id='type-id-101'/>
    <typedef-decl name='uint64_t' type-id='type-id-217' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-144'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='32' id='type-id-140'/>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='128' id='type-id-131'>
      <subrange length='16' type-id='type-id-4' id='type-id-218'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='2048' id='type-id-120'>
      <subrange length='256' type-id='type-id-4' id='type-id-219'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='256' id='type-id-96'>
      <subrange length='32' type-id='type-id-4' id='type-id-220'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='512' id='type-id-119'>
      <subrange length='64' type-id='type-id-4' id='type-id-221'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-222' size-in-bits='32' id='type-id-93'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='32' id='type-id-95'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='32' id='type-id-80'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='32' id='type-id-84'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='32' id='type-id-76'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='32' id='type-id-168'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='32' id='type-id-178'/>
    <class-decl name='cert_st' size-in-bits='2176' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1879' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-228' visibility='default' filepath='ssl/ssl_local.h' line='1886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dh_tmp' type-id='type-id-229' visibility='default' filepath='ssl/ssl_local.h' line='1888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dh_tmp_cb' type-id='type-id-230' visibility='default' filepath='ssl/ssl_local.h' line='1889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_tmp_auto' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cert_flags' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pkeys' type-id='type-id-231' visibility='default' filepath='ssl/ssl_local.h' line='1894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ctype' type-id='type-id-140' visibility='default' filepath='ssl/ssl_local.h' line='1896' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='ctype_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='conf_sigalgs' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='conf_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='client_sigalgs' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='client_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='cert_cb' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='cert_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='chain_store' type-id='type-id-232' visibility='default' filepath='ssl/ssl_local.h' line='1929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='verify_store' type-id='type-id-232' visibility='default' filepath='ssl/ssl_local.h' line='1930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='custext' type-id='type-id-233' visibility='default' filepath='ssl/ssl_local.h' line='1932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='sec_cb' type-id='type-id-234' visibility='default' filepath='ssl/ssl_local.h' line='1934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='sec_level' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='sec_ex' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='psk_identity_hint' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='lock' type-id='type-id-113' visibility='default' filepath='ssl/ssl_local.h' line='1944' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='crypto_ex_data_st' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/openssl/crypto.h' line='86' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sk' type-id='type-id-235' visibility='default' filepath='include/openssl/crypto.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dtls1_state_st' size-in-bits='3264' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1774' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='type-id-120' visibility='default' filepath='ssl/ssl_local.h' line='1775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='cookie_verified' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='handshake_write_seq' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='next_handshake_write_seq' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='handshake_read_seq' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='buffered_messages' type-id='type-id-236' visibility='default' filepath='ssl/ssl_local.h' line='1783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='sent_messages' type-id='type-id-236' visibility='default' filepath='ssl/ssl_local.h' line='1785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='link_mtu' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='mtu' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='w_msg_hdr' type-id='type-id-237' visibility='default' filepath='ssl/ssl_local.h' line='1788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='r_msg_hdr' type-id='type-id-237' visibility='default' filepath='ssl/ssl_local.h' line='1789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='timeout' type-id='type-id-238' visibility='default' filepath='ssl/ssl_local.h' line='1790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='next_timeout' type-id='type-id-239' visibility='default' filepath='ssl/ssl_local.h' line='1794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='timeout_duration_us' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1796' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='retransmitting' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='timer_cb' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='1803' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lhash_st_SSL_SESSION' size-in-bits='32' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-241' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ossl_statem_st' size-in-bits='480' is-struct='yes' visibility='default' filepath='ssl/statem/statem.h' line='98' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-242' visibility='default' filepath='ssl/statem/statem.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='write_state' type-id='type-id-243' visibility='default' filepath='ssl/statem/statem.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_state_work' type-id='type-id-244' visibility='default' filepath='ssl/statem/statem.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='read_state' type-id='type-id-245' visibility='default' filepath='ssl/statem/statem.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='read_state_work' type-id='type-id-244' visibility='default' filepath='ssl/statem/statem.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hand_state' type-id='type-id-246' visibility='default' filepath='ssl/statem/statem.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='request_state' type-id='type-id-246' visibility='default' filepath='ssl/statem/statem.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='in_init' type-id='type-id-18' visibility='default' filepath='ssl/statem/statem.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read_state_first_init' type-id='type-id-18' visibility='default' filepath='ssl/statem/statem.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='in_handshake' type-id='type-id-18' visibility='default' filepath='ssl/statem/statem.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cleanuphand' type-id='type-id-18' visibility='default' filepath='ssl/statem/statem.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='no_cert_verify' type-id='type-id-4' visibility='default' filepath='ssl/statem/statem.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_timer' type-id='type-id-18' visibility='default' filepath='ssl/statem/statem.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='enc_write_state' type-id='type-id-247' visibility='default' filepath='ssl/statem/statem.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='enc_read_state' type-id='type-id-248' visibility='default' filepath='ssl/statem/statem.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='record_layer_st' size-in-bits='18272' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='127' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-10' visibility='default' filepath='ssl/record/record.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='read_ahead' type-id='type-id-18' visibility='default' filepath='ssl/record/record.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rstate' type-id='type-id-18' visibility='default' filepath='ssl/record/record.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='numrpipes' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='numwpipes' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rbuf' type-id='type-id-249' visibility='default' filepath='ssl/record/record.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='wbuf' type-id='type-id-250' visibility='default' filepath='ssl/record/record.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='rrec' type-id='type-id-251' visibility='default' filepath='ssl/record/record.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='packet' type-id='type-id-65' visibility='default' filepath='ssl/record/record.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17760'>
        <var-decl name='packet_length' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17792'>
        <var-decl name='wnum' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17824'>
        <var-decl name='handshake_fragment' type-id='type-id-252' visibility='default' filepath='ssl/record/record.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17856'>
        <var-decl name='handshake_fragment_len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17888'>
        <var-decl name='empty_record_count' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17920'>
        <var-decl name='wpend_tot' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17952'>
        <var-decl name='wpend_type' type-id='type-id-18' visibility='default' filepath='ssl/record/record.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='wpend_ret' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18016'>
        <var-decl name='wpend_buf' type-id='type-id-44' visibility='default' filepath='ssl/record/record.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='read_sequence' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='write_sequence' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='is_first_record' type-id='type-id-4' visibility='default' filepath='ssl/record/record.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18208'>
        <var-decl name='alert_count' type-id='type-id-4' visibility='default' filepath='ssl/record/record.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18240'>
        <var-decl name='d' type-id='type-id-254' visibility='default' filepath='ssl/record/record.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='srp_ctx_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='SRP_cb_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='TLS_ext_srp_username_callback' type-id='type-id-167' visibility='default' filepath='ssl/ssl_local.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='SRP_verify_param_callback' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='SRP_give_srp_client_pwd_callback' type-id='type-id-255' visibility='default' filepath='ssl/ssl_local.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='login' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='N' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='g' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='s' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='B' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='A' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='a' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='b' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='v' type-id='type-id-256' visibility='default' filepath='ssl/ssl_local.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='info' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strength' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='srp_Mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl3_state_st' size-in-bits='6880' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1531' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-48' visibility='default' filepath='ssl/ssl_local.h' line='1532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='read_mac_secret_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='read_mac_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='write_mac_secret_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='write_mac_secret' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='server_random' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='1537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='client_random' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='1538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='need_empty_fragments' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='empty_fragment_done' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='handshake_buffer' type-id='type-id-122' visibility='default' filepath='ssl/ssl_local.h' line='1543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='handshake_dgst' type-id='type-id-132' visibility='default' filepath='ssl/ssl_local.h' line='1548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='change_cipher_spec' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='warn_alert' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='fatal_alert' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='alert_dispatch' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='send_alert' type-id='type-id-257' visibility='default' filepath='ssl/ssl_local.h' line='1562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='renegotiate' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='total_renegotiations' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='num_renegotiations' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='in_read_app_data' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tmp' type-id='type-id-258' visibility='default' filepath='ssl/ssl_local.h' line='1651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='previous_client_finished' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='previous_client_finished_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='previous_server_finished' type-id='type-id-119' visibility='default' filepath='ssl/ssl_local.h' line='1656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='previous_server_finished_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='send_connection_binding' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='npn_seen' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='alpn_selected' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='alpn_selected_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='alpn_proposed' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='alpn_proposed_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='alpn_sent' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='is_probably_safari' type-id='type-id-52' visibility='default' filepath='ssl/ssl_local.h' line='1691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6832'>
        <var-decl name='group_id' type-id='type-id-40' visibility='default' filepath='ssl/ssl_local.h' line='1697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='peer_tmp' type-id='type-id-229' visibility='default' filepath='ssl/ssl_local.h' line='1698' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_dane_st' size-in-bits='288' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='66' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dctx' type-id='type-id-259' visibility='default' filepath='include/internal/dane.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='trecs' type-id='type-id-260' visibility='default' filepath='include/internal/dane.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='certs' type-id='type-id-92' visibility='default' filepath='include/internal/dane.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mtlsa' type-id='type-id-261' visibility='default' filepath='include/internal/dane.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mcert' type-id='type-id-38' visibility='default' filepath='include/internal/dane.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='umask' type-id='type-id-33' visibility='default' filepath='include/internal/dane.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mdpth' type-id='type-id-18' visibility='default' filepath='include/internal/dane.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pdpth' type-id='type-id-18' visibility='default' filepath='include/internal/dane.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='include/internal/dane.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stack_st_SCT' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-198'/>
    <class-decl name='stack_st_SRTP_PROTECTION_PROFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-199'/>
    <class-decl name='stack_st_SSL_CIPHER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-200'/>
    <class-decl name='stack_st_X509' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-201'/>
    <class-decl name='x509_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1281' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-262' visibility='default' filepath='ssl/ssl_local.h' line='1283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='exts' type-id='type-id-263' visibility='default' filepath='ssl/ssl_local.h' line='1284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resp' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='resp_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1287' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-45' size-in-bits='32' id='type-id-164'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-181'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='32' id='type-id-182'/>
    <enum-decl name='__anonymous_enum__10' is-anonymous='yes' filepath='ssl/ssl_local.h' line='403' column='1' id='type-id-210'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='SSL_PHA_NONE' value='0'/>
      <enumerator name='SSL_PHA_EXT_SENT' value='1'/>
      <enumerator name='SSL_PHA_EXT_RECEIVED' value='2'/>
      <enumerator name='SSL_PHA_REQUEST_PENDING' value='3'/>
      <enumerator name='SSL_PHA_REQUESTED' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__8' is-anonymous='yes' filepath='ssl/ssl_local.h' line='615' column='1' id='type-id-209'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='SSL_EARLY_DATA_NONE' value='0'/>
      <enumerator name='SSL_EARLY_DATA_CONNECT_RETRY' value='1'/>
      <enumerator name='SSL_EARLY_DATA_CONNECTING' value='2'/>
      <enumerator name='SSL_EARLY_DATA_WRITE_RETRY' value='3'/>
      <enumerator name='SSL_EARLY_DATA_WRITING' value='4'/>
      <enumerator name='SSL_EARLY_DATA_WRITE_FLUSH' value='5'/>
      <enumerator name='SSL_EARLY_DATA_UNAUTH_WRITING' value='6'/>
      <enumerator name='SSL_EARLY_DATA_FINISHED_WRITING' value='7'/>
      <enumerator name='SSL_EARLY_DATA_ACCEPT_RETRY' value='8'/>
      <enumerator name='SSL_EARLY_DATA_ACCEPTING' value='9'/>
      <enumerator name='SSL_EARLY_DATA_READ_RETRY' value='10'/>
      <enumerator name='SSL_EARLY_DATA_READING' value='11'/>
      <enumerator name='SSL_EARLY_DATA_FINISHED_READING' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-266' size-in-bits='32' id='type-id-214'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='32' id='type-id-172'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='32' id='type-id-212'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='32' id='type-id-167'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='32' id='type-id-169'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='32' id='type-id-170'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='32' id='type-id-216'/>
    <typedef-decl name='ASYNC_JOB' type-id='type-id-273' filepath='include/openssl/async.h' line='32' column='1' id='type-id-149'/>
    <typedef-decl name='ASYNC_WAIT_CTX' type-id='type-id-274' filepath='include/openssl/async.h' line='33' column='1' id='type-id-150'/>
    <typedef-decl name='BIO' type-id='type-id-275' filepath='include/openssl/ossl_typ.h' line='79' column='1' id='type-id-151'/>
    <typedef-decl name='BUF_MEM' type-id='type-id-276' filepath='include/openssl/ossl_typ.h' line='87' column='1' id='type-id-152'/>
    <typedef-decl name='CLIENTHELLO_MSG' type-id='type-id-277' filepath='ssl/ssl_local.h' line='686' column='1' id='type-id-153'/>
    <typedef-decl name='COMP_CTX' type-id='type-id-278' filepath='include/openssl/ossl_typ.h' line='153' column='1' id='type-id-154'/>
    <typedef-decl name='CRYPTO_RWLOCK' type-id='type-id-1' filepath='include/openssl/crypto.h' line='67' column='1' id='type-id-155'/>
    <typedef-decl name='CTLOG_STORE' type-id='type-id-279' filepath='include/openssl/ossl_typ.h' line='175' column='1' id='type-id-156'/>
    <typedef-decl name='ENGINE' type-id='type-id-280' filepath='include/openssl/ossl_typ.h' line='149' column='1' id='type-id-157'/>
    <typedef-decl name='EVP_CIPHER_CTX' type-id='type-id-281' filepath='include/openssl/ossl_typ.h' line='90' column='1' id='type-id-158'/>
    <typedef-decl name='EVP_MD_CTX' type-id='type-id-282' filepath='include/openssl/ossl_typ.h' line='92' column='1' id='type-id-159'/>
    <typedef-decl name='SRTP_PROTECTION_PROFILE' type-id='type-id-283' filepath='include/openssl/ssl.h' line='235' column='1' id='type-id-160'/>
    <typedef-decl name='SSL_CTX_npn_advertised_cb_func' type-id='type-id-284' filepath='include/openssl/ssl.h' line='776' column='1' id='type-id-173'/>
    <typedef-decl name='SSL_CTX_npn_select_cb_func' type-id='type-id-285' filepath='include/openssl/ssl.h' line='785' column='1' id='type-id-174'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='32' id='type-id-206'/>
    <typedef-decl name='X509_VERIFY_PARAM' type-id='type-id-287' filepath='include/openssl/ossl_typ.h' line='136' column='1' id='type-id-162'/>
    <typedef-decl name='__uint64_t' type-id='type-id-288' filepath='/usr/include/bits/types.h' line='48' column='1' id='type-id-217'/>
    <typedef-decl name='int32_t' type-id='type-id-289' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-166'/>
    <typedef-decl name='pem_password_cb' type-id='type-id-290' filepath='include/openssl/pem.h' line='231' column='1' id='type-id-196'/>
    <typedef-decl name='tls_session_secret_cb_fn' type-id='type-id-291' filepath='include/openssl/ssl.h' line='241' column='1' id='type-id-180'/>
    <typedef-decl name='tls_session_ticket_ext_cb_fn' type-id='type-id-292' filepath='include/openssl/ssl.h' line='239' column='1' id='type-id-179'/>
    <typedef-decl name='uint8_t' type-id='type-id-293' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='32' id='type-id-171'/>
    <array-type-def dimensions='1' type-id='type-id-165' size-in-bits='208' id='type-id-175'>
      <subrange length='26' type-id='type-id-4' id='type-id-294'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-295' size-in-bits='32' id='type-id-211'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='32' id='type-id-213'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='32' id='type-id-176'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='32' id='type-id-207'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='32' id='type-id-256'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='32' id='type-id-228'/>
    <array-type-def dimensions='1' type-id='type-id-300' size-in-bits='1440' id='type-id-231'>
      <subrange length='9' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-301' size-in-bits='32' id='type-id-230'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='32' id='type-id-254'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='32' id='type-id-229'/>
    <array-type-def dimensions='1' type-id='type-id-249' size-in-bits='5120' id='type-id-250'>
      <subrange length='32' type-id='type-id-4' id='type-id-220'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-304' size-in-bits='12288' id='type-id-251'>
      <subrange length='32' type-id='type-id-4' id='type-id-220'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-305' size-in-bits='32' id='type-id-263'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='32' id='type-id-232'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='32' id='type-id-255'/>
    <class-decl name='X509_VERIFY_PARAM_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-287'/>
    <class-decl name='async_job_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-273'/>
    <class-decl name='async_wait_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-274'/>
    <class-decl name='bio_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-275'/>
    <class-decl name='buf_mem_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/buffer.h' line='38' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-8' visibility='default' filepath='include/openssl/buffer.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='type-id-2' visibility='default' filepath='include/openssl/buffer.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max' type-id='type-id-8' visibility='default' filepath='include/openssl/buffer.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='include/openssl/buffer.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='comp_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-278'/>
    <class-decl name='ctlog_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-279'/>
    <class-decl name='dtls1_timeout_st' size-in-bits='96' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1736' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_timeouts' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='write_timeouts' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_alerts' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1742' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='engine_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-280'/>
    <class-decl name='evp_cipher_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-281'/>
    <class-decl name='evp_md_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-282'/>
    <class-decl name='hm_header_st' size-in-bits='352' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1726' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-69' visibility='default' filepath='ssl/ssl_local.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='msg_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='seq' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='frag_off' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frag_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='is_ccs' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='saved_retransmit_state' type-id='type-id-308' visibility='default' filepath='ssl/ssl_local.h' line='1733' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='srtp_protection_profile_st' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/openssl/ssl.h' line='232' column='1' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='include/openssl/ssl.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='id' type-id='type-id-19' visibility='default' filepath='include/openssl/ssl.h' line='234' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-309' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tv_usec' type-id='type-id-310' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='11' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='3456' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1571' column='1' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finish_md' type-id='type-id-311' visibility='default' filepath='ssl/ssl_local.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='finish_md_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='peer_finish_md' type-id='type-id-311' visibility='default' filepath='ssl/ssl_local.h' line='1575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='peer_finish_md_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='message_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='message_type' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='new_cipher' type-id='type-id-39' visibility='default' filepath='ssl/ssl_local.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='pkey' type-id='type-id-229' visibility='default' filepath='ssl/ssl_local.h' line='1582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='cert_req' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='ctype' type-id='type-id-140' visibility='default' filepath='ssl/ssl_local.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='ctype_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='peer_ca_names' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='1590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='key_block_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='key_block' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='new_sym_enc' type-id='type-id-312' visibility='default' filepath='ssl/ssl_local.h' line='1593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='new_hash' type-id='type-id-45' visibility='default' filepath='ssl/ssl_local.h' line='1594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='new_mac_pkey_type' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='new_mac_secret_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='new_compression' type-id='type-id-43' visibility='default' filepath='ssl/ssl_local.h' line='1598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='cert_request' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='ciphers_raw' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='ciphers_rawlen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='pms' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='pmslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='psk' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='psklen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='sigalg' type-id='type-id-313' visibility='default' filepath='ssl/ssl_local.h' line='1615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='cert' type-id='type-id-228' visibility='default' filepath='ssl/ssl_local.h' line='1617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='peer_sigalgs' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='peer_cert_sigalgs' type-id='type-id-171' visibility='default' filepath='ssl/ssl_local.h' line='1625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='peer_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='peer_cert_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='peer_sigalg' type-id='type-id-313' visibility='default' filepath='ssl/ssl_local.h' line='1630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='valid_flags' type-id='type-id-314' visibility='default' filepath='ssl/ssl_local.h' line='1636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='mask_k' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='mask_a' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='min_ver' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='max_ver' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1650' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='4960' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-153' visibility='default' filepath='ssl/ssl_local.h' line='672' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='isv2' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='legacy_version' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='random' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='session_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='session_id' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='dtls_cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dtls_cookie' type-id='type-id-120' visibility='default' filepath='ssl/ssl_local.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='ciphersuites' type-id='type-id-315' visibility='default' filepath='ssl/ssl_local.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='compressions_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='compressions' type-id='type-id-316' visibility='default' filepath='ssl/ssl_local.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='extensions' type-id='type-id-315' visibility='default' filepath='ssl/ssl_local.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='pre_proc_exts_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='pre_proc_exts' type-id='type-id-317' visibility='default' filepath='ssl/ssl_local.h' line='685' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-265'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='32' id='type-id-259'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='32' id='type-id-261'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='32' id='type-id-284'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='32' id='type-id-292'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='32' id='type-id-285'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='32' id='type-id-291'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='32' id='type-id-234'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='32' id='type-id-236'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='32' id='type-id-262'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='32' id='type-id-260'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='32' id='type-id-235'/>
    <typedef-decl name='DTLS_timer_cb' type-id='type-id-329' filepath='include/openssl/ssl.h' line='2432' column='1' id='type-id-240'/>
    <typedef-decl name='ENC_READ_STATES' type-id='type-id-330' filepath='ssl/statem/statem.h' line='88' column='1' id='type-id-248'/>
    <typedef-decl name='ENC_WRITE_STATES' type-id='type-id-331' filepath='ssl/statem/statem.h' line='81' column='1' id='type-id-247'/>
    <typedef-decl name='MSG_FLOW_STATE' type-id='type-id-332' filepath='ssl/statem/statem.h' line='57' column='1' id='type-id-242'/>
    <typedef-decl name='OSSL_HANDSHAKE_STATE' type-id='type-id-333' filepath='include/openssl/ssl.h' line='1052' column='1' id='type-id-246'/>
    <typedef-decl name='READ_STATE' type-id='type-id-334' filepath='ssl/statem/statem.h' line='64' column='1' id='type-id-245'/>
    <typedef-decl name='SSL3_BUFFER' type-id='type-id-335' filepath='ssl/record/record.h' line='28' column='1' id='type-id-249'/>
    <typedef-decl name='SSL_CTX_EXT_SECURE' type-id='type-id-336' filepath='ssl/ssl_local.h' line='733' column='1' id='type-id-226'/>
    <typedef-decl name='SSL_METHOD' type-id='type-id-337' filepath='include/openssl/ssl.h' line='221' column='1' id='type-id-264'/>
    <typedef-decl name='TLS_SESSION_TICKET_EXT' type-id='type-id-338' filepath='include/openssl/ssl.h' line='220' column='1' id='type-id-227'/>
    <typedef-decl name='WORK_STATE' type-id='type-id-339' filepath='ssl/statem/statem.h' line='33' column='1' id='type-id-244'/>
    <typedef-decl name='WRITE_STATE' type-id='type-id-340' filepath='ssl/statem/statem.h' line='72' column='1' id='type-id-243'/>
    <typedef-decl name='__int32_t' type-id='type-id-18' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-289'/>
    <typedef-decl name='__uint8_t' type-id='type-id-69' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-293'/>
    <typedef-decl name='custom_ext_methods' type-id='type-id-341' filepath='ssl/ssl_local.h' line='1877' column='1' id='type-id-233'/>
    <union-decl name='lh_SSL_SESSION_dummy' size-in-bits='32' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1' id='type-id-241'>
      <data-member access='private'>
        <var-decl name='d1' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='d2' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='d3' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='16' id='type-id-257'>
      <subrange length='2' type-id='type-id-4' id='type-id-342'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='32' id='type-id-252'>
      <subrange length='4' type-id='type-id-4' id='type-id-343'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='64' id='type-id-253'>
      <subrange length='8' type-id='type-id-4' id='type-id-344'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-345' size-in-bits='32' id='type-id-317'/>
    <class-decl name='dtls1_retransmit_state' size-in-bits='160' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1718' column='1' id='type-id-308'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enc_write_ctx' type-id='type-id-130' visibility='default' filepath='ssl/ssl_local.h' line='1719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='write_hash' type-id='type-id-132' visibility='default' filepath='ssl/ssl_local.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='compress' type-id='type-id-133' visibility='default' filepath='ssl/ssl_local.h' line='1721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='session' type-id='type-id-34' visibility='default' filepath='ssl/ssl_local.h' line='1722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='epoch' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1723' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sigalg_lookup_st' size-in-bits='256' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1488' column='1' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='1490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sigalg' type-id='type-id-40' visibility='default' filepath='ssl/ssl_local.h' line='1492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='hash_idx' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sig' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sig_idx' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sigandhash' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='curve' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='1504' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl3_buffer_st' size-in-bits='160' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='17' column='1' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-65' visibility='default' filepath='ssl/record/record.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='default_len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='offset' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='left' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_ctx_ext_secure_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='730' column='1' id='type-id-336'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tick_hmac_key' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tick_aes_key' type-id='type-id-96' visibility='default' filepath='ssl/ssl_local.h' line='732' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_method_st' size-in-bits='928' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='438' column='1' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ssl_new' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ssl_clear' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ssl_free' type-id='type-id-346' visibility='default' filepath='ssl/ssl_local.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ssl_accept' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='ssl_connect' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ssl_read' type-id='type-id-347' visibility='default' filepath='ssl/ssl_local.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ssl_peek' type-id='type-id-347' visibility='default' filepath='ssl/ssl_local.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ssl_write' type-id='type-id-347' visibility='default' filepath='ssl/ssl_local.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ssl_shutdown' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ssl_renegotiate' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='ssl_renegotiate_check' type-id='type-id-112' visibility='default' filepath='ssl/ssl_local.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ssl_read_bytes' type-id='type-id-348' visibility='default' filepath='ssl/ssl_local.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ssl_write_bytes' type-id='type-id-349' visibility='default' filepath='ssl/ssl_local.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ssl_dispatch_alert' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ssl_ctrl' type-id='type-id-350' visibility='default' filepath='ssl/ssl_local.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ssl_ctx_ctrl' type-id='type-id-351' visibility='default' filepath='ssl/ssl_local.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='get_cipher_by_char' type-id='type-id-352' visibility='default' filepath='ssl/ssl_local.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='put_cipher_by_char' type-id='type-id-353' visibility='default' filepath='ssl/ssl_local.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='ssl_pending' type-id='type-id-354' visibility='default' filepath='ssl/ssl_local.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='num_ciphers' type-id='type-id-355' visibility='default' filepath='ssl/ssl_local.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='get_cipher' type-id='type-id-356' visibility='default' filepath='ssl/ssl_local.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_timeout' type-id='type-id-357' visibility='default' filepath='ssl/ssl_local.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='ssl3_enc' type-id='type-id-358' visibility='default' filepath='ssl/ssl_local.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ssl_version' type-id='type-id-355' visibility='default' filepath='ssl/ssl_local.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='ssl_callback_ctrl' type-id='type-id-359' visibility='default' filepath='ssl/ssl_local.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ssl_ctx_callback_ctrl' type-id='type-id-360' visibility='default' filepath='ssl/ssl_local.h' line='471' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stack_st_OCSP_RESPID' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-326'/>
    <class-decl name='stack_st_danetls_record' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-327'/>
    <class-decl name='stack_st_void' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-328'/>
    <class-decl name='tls_session_ticket_ext_st' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/openssl/tls1.h' line='1229' column='1' id='type-id-338'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-73' visibility='default' filepath='include/openssl/tls1.h' line='1230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='type-id-84' visibility='default' filepath='include/openssl/tls1.h' line='1231' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-233' visibility='default' filepath='ssl/ssl_local.h' line='1874' column='1' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='meths' type-id='type-id-361' visibility='default' filepath='ssl/ssl_local.h' line='1875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='meths_count' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1876' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-362' size-in-bits='32' id='type-id-312'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='32' id='type-id-313'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='ssl/statem/statem.h' line='46' column='1' id='type-id-332'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='MSG_FLOW_UNINITED' value='0'/>
      <enumerator name='MSG_FLOW_ERROR' value='1'/>
      <enumerator name='MSG_FLOW_READING' value='2'/>
      <enumerator name='MSG_FLOW_WRITING' value='3'/>
      <enumerator name='MSG_FLOW_FINISHED' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' filepath='ssl/statem/statem.h' line='67' column='1' id='type-id-340'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='WRITE_STATE_TRANSITION' value='0'/>
      <enumerator name='WRITE_STATE_PRE_WORK' value='1'/>
      <enumerator name='WRITE_STATE_SEND' value='2'/>
      <enumerator name='WRITE_STATE_POST_WORK' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' filepath='ssl/statem/statem.h' line='20' column='1' id='type-id-339'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='WORK_ERROR' value='0'/>
      <enumerator name='WORK_FINISHED_STOP' value='1'/>
      <enumerator name='WORK_FINISHED_CONTINUE' value='2'/>
      <enumerator name='WORK_MORE_A' value='3'/>
      <enumerator name='WORK_MORE_B' value='4'/>
      <enumerator name='WORK_MORE_C' value='5'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' filepath='ssl/statem/statem.h' line='60' column='1' id='type-id-334'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='READ_STATE_HEADER' value='0'/>
      <enumerator name='READ_STATE_BODY' value='1'/>
      <enumerator name='READ_STATE_POST_PROCESS' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__5' is-anonymous='yes' filepath='include/openssl/ssl.h' line='1001' column='1' id='type-id-333'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='TLS_ST_BEFORE' value='0'/>
      <enumerator name='TLS_ST_OK' value='1'/>
      <enumerator name='DTLS_ST_CR_HELLO_VERIFY_REQUEST' value='2'/>
      <enumerator name='TLS_ST_CR_SRVR_HELLO' value='3'/>
      <enumerator name='TLS_ST_CR_CERT' value='4'/>
      <enumerator name='TLS_ST_CR_CERT_STATUS' value='5'/>
      <enumerator name='TLS_ST_CR_KEY_EXCH' value='6'/>
      <enumerator name='TLS_ST_CR_CERT_REQ' value='7'/>
      <enumerator name='TLS_ST_CR_SRVR_DONE' value='8'/>
      <enumerator name='TLS_ST_CR_SESSION_TICKET' value='9'/>
      <enumerator name='TLS_ST_CR_CHANGE' value='10'/>
      <enumerator name='TLS_ST_CR_FINISHED' value='11'/>
      <enumerator name='TLS_ST_CW_CLNT_HELLO' value='12'/>
      <enumerator name='TLS_ST_CW_CERT' value='13'/>
      <enumerator name='TLS_ST_CW_KEY_EXCH' value='14'/>
      <enumerator name='TLS_ST_CW_CERT_VRFY' value='15'/>
      <enumerator name='TLS_ST_CW_CHANGE' value='16'/>
      <enumerator name='TLS_ST_CW_NEXT_PROTO' value='17'/>
      <enumerator name='TLS_ST_CW_FINISHED' value='18'/>
      <enumerator name='TLS_ST_SW_HELLO_REQ' value='19'/>
      <enumerator name='TLS_ST_SR_CLNT_HELLO' value='20'/>
      <enumerator name='DTLS_ST_SW_HELLO_VERIFY_REQUEST' value='21'/>
      <enumerator name='TLS_ST_SW_SRVR_HELLO' value='22'/>
      <enumerator name='TLS_ST_SW_CERT' value='23'/>
      <enumerator name='TLS_ST_SW_KEY_EXCH' value='24'/>
      <enumerator name='TLS_ST_SW_CERT_REQ' value='25'/>
      <enumerator name='TLS_ST_SW_SRVR_DONE' value='26'/>
      <enumerator name='TLS_ST_SR_CERT' value='27'/>
      <enumerator name='TLS_ST_SR_KEY_EXCH' value='28'/>
      <enumerator name='TLS_ST_SR_CERT_VRFY' value='29'/>
      <enumerator name='TLS_ST_SR_NEXT_PROTO' value='30'/>
      <enumerator name='TLS_ST_SR_CHANGE' value='31'/>
      <enumerator name='TLS_ST_SR_FINISHED' value='32'/>
      <enumerator name='TLS_ST_SW_SESSION_TICKET' value='33'/>
      <enumerator name='TLS_ST_SW_CERT_STATUS' value='34'/>
      <enumerator name='TLS_ST_SW_CHANGE' value='35'/>
      <enumerator name='TLS_ST_SW_FINISHED' value='36'/>
      <enumerator name='TLS_ST_SW_ENCRYPTED_EXTENSIONS' value='37'/>
      <enumerator name='TLS_ST_CR_ENCRYPTED_EXTENSIONS' value='38'/>
      <enumerator name='TLS_ST_CR_CERT_VRFY' value='39'/>
      <enumerator name='TLS_ST_SW_CERT_VRFY' value='40'/>
      <enumerator name='TLS_ST_CR_HELLO_REQ' value='41'/>
      <enumerator name='TLS_ST_SW_KEY_UPDATE' value='42'/>
      <enumerator name='TLS_ST_CW_KEY_UPDATE' value='43'/>
      <enumerator name='TLS_ST_SR_KEY_UPDATE' value='44'/>
      <enumerator name='TLS_ST_CR_KEY_UPDATE' value='45'/>
      <enumerator name='TLS_ST_EARLY_DATA' value='46'/>
      <enumerator name='TLS_ST_PENDING_EARLY_DATA_END' value='47'/>
      <enumerator name='TLS_ST_CW_END_OF_EARLY_DATA' value='48'/>
      <enumerator name='TLS_ST_SR_END_OF_EARLY_DATA' value='49'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__6' is-anonymous='yes' filepath='ssl/statem/statem.h' line='74' column='1' id='type-id-331'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='ENC_WRITE_STATE_VALID' value='0'/>
      <enumerator name='ENC_WRITE_STATE_INVALID' value='1'/>
      <enumerator name='ENC_WRITE_STATE_WRITE_PLAIN_ALERTS' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__7' is-anonymous='yes' filepath='ssl/statem/statem.h' line='83' column='1' id='type-id-330'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='ENC_READ_STATE_VALID' value='0'/>
      <enumerator name='ENC_READ_STATE_ALLOW_PLAIN_ALERTS' value='1'/>
    </enum-decl>
    <typedef-decl name='BIGNUM' type-id='type-id-364' filepath='include/openssl/ossl_typ.h' line='80' column='1' id='type-id-299'/>
    <typedef-decl name='CERT_PKEY' type-id='type-id-365' filepath='ssl/ssl_local.h' line='1520' column='1' id='type-id-300'/>
    <typedef-decl name='DTLS_RECORD_LAYER' type-id='type-id-366' filepath='ssl/record/record.h' line='117' column='1' id='type-id-302'/>
    <typedef-decl name='EVP_PKEY' type-id='type-id-367' filepath='include/openssl/ossl_typ.h' line='93' column='1' id='type-id-303'/>
    <typedef-decl name='PACKET' type-id='type-id-368' filepath='ssl/packet_local.h' line='26' column='1' id='type-id-315'/>
    <typedef-decl name='SSL3_RECORD' type-id='type-id-369' filepath='ssl/record/record.h' line='69' column='1' id='type-id-304'/>
    <typedef-decl name='X509_EXTENSIONS' type-id='type-id-370' filepath='include/openssl/x509.h' line='83' column='1' id='type-id-305'/>
    <typedef-decl name='X509_STORE' type-id='type-id-225' filepath='include/openssl/ossl_typ.h' line='130' column='1' id='type-id-306'/>
    <typedef-decl name='__suseconds_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='162' column='1' id='type-id-310'/>
    <typedef-decl name='__time_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-309'/>
    <typedef-decl name='danetls_record' type-id='type-id-371' filepath='include/internal/dane.h' line='49' column='1' id='type-id-319'/>
    <typedef-decl name='pqueue' type-id='type-id-372' filepath='ssl/ssl_local.h' line='1751' column='1' id='type-id-325'/>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='288' id='type-id-314'>
      <subrange length='9' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='1024' id='type-id-311'>
      <subrange length='128' type-id='type-id-4' id='type-id-373'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='2040' id='type-id-316'>
      <subrange length='255' type-id='type-id-4' id='type-id-374'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-375' size-in-bits='32' id='type-id-329'/>
    <class-decl name='bignum_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-364'/>
    <class-decl name='cert_pkey_st' size-in-bits='160' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1816' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x509' type-id='type-id-38' visibility='default' filepath='ssl/ssl_local.h' line='1817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='privatekey' type-id='type-id-229' visibility='default' filepath='ssl/ssl_local.h' line='1818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='chain' type-id='type-id-92' visibility='default' filepath='ssl/ssl_local.h' line='1820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='serverinfo' type-id='type-id-65' visibility='default' filepath='ssl/ssl_local.h' line='1828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='serverinfo_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1829' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='danetls_record_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='42' column='1' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='type-id-165' visibility='default' filepath='include/internal/dane.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='selector' type-id='type-id-165' visibility='default' filepath='include/internal/dane.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mtype' type-id='type-id-165' visibility='default' filepath='include/internal/dane.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='type-id-65' visibility='default' filepath='include/internal/dane.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dlen' type-id='type-id-8' visibility='default' filepath='include/internal/dane.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='spki' type-id='type-id-229' visibility='default' filepath='include/internal/dane.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dtls_record_layer_st' size-in-bits='544' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='93' column='1' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r_epoch' type-id='type-id-73' visibility='default' filepath='ssl/record/record.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='w_epoch' type-id='type-id-73' visibility='default' filepath='ssl/record/record.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bitmap' type-id='type-id-376' visibility='default' filepath='ssl/record/record.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next_bitmap' type-id='type-id-376' visibility='default' filepath='ssl/record/record.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='unprocessed_rcds' type-id='type-id-377' visibility='default' filepath='ssl/record/record.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='processed_rcds' type-id='type-id-377' visibility='default' filepath='ssl/record/record.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='buffered_app_data' type-id='type-id-377' visibility='default' filepath='ssl/record/record.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='last_write_sequence' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='curr_write_sequence' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='evp_pkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-367'/>
    <class-decl name='pqueue_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-372'/>
    <class-decl name='ssl3_record_st' size-in-bits='384' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='32' column='1' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rec_version' type-id='type-id-18' visibility='default' filepath='ssl/record/record.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-18' visibility='default' filepath='ssl/record/record.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='orig_len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='off' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='data' type-id='type-id-65' visibility='default' filepath='ssl/record/record.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='input' type-id='type-id-65' visibility='default' filepath='ssl/record/record.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='comp' type-id='type-id-65' visibility='default' filepath='ssl/record/record.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read' type-id='type-id-4' visibility='default' filepath='ssl/record/record.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='epoch' type-id='type-id-19' visibility='default' filepath='ssl/record/record.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='seq_num' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stack_st_X509_EXTENSION' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-370'/>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-315' visibility='default' filepath='ssl/packet_local.h' line='21' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='curr' type-id='type-id-44' visibility='default' filepath='ssl/packet_local.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='remaining' type-id='type-id-8' visibility='default' filepath='ssl/packet_local.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-362'/>
    <qualified-type-def type-id='type-id-379' const='yes' id='type-id-363'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='32' id='type-id-352'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='32' id='type-id-356'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='32' id='type-id-358'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='32' id='type-id-361'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='32' id='type-id-355'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='32' id='type-id-348'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='32' id='type-id-349'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='32' id='type-id-347'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='32' id='type-id-353'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='32' id='type-id-357'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='32' id='type-id-350'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='32' id='type-id-359'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='32' id='type-id-351'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='32' id='type-id-360'/>
    <typedef-decl name='RAW_EXTENSION' type-id='type-id-394' filepath='ssl/ssl_local.h' line='670' column='1' id='type-id-345'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='32' id='type-id-354'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='32' id='type-id-346'/>
    <class-decl name='raw_extension_st' size-in-bits='192' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='659' column='1' id='type-id-394'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-315' visibility='default' filepath='ssl/ssl_local.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='present' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='parsed' type-id='type-id-18' visibility='default' filepath='ssl/ssl_local.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='received_order' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='669' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-397' const='yes' id='type-id-382'/>
    <typedef-decl name='DTLS1_BITMAP' type-id='type-id-398' filepath='ssl/record/record.h' line='76' column='1' id='type-id-376'/>
    <typedef-decl name='EVP_CIPHER' type-id='type-id-399' filepath='include/openssl/ossl_typ.h' line='89' column='1' id='type-id-378'/>
    <typedef-decl name='SIGALG_LOOKUP' type-id='type-id-318' filepath='ssl/ssl_local.h' line='1505' column='1' id='type-id-379'/>
    <typedef-decl name='custom_ext_method' type-id='type-id-400' filepath='ssl/ssl_local.h' line='1859' column='1' id='type-id-383'/>
    <typedef-decl name='record_pqueue' type-id='type-id-401' filepath='ssl/record/record.h' line='81' column='1' id='type-id-377'/>
    <class-decl name='dtls1_bitmap_st' size-in-bits='96' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='71' column='1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='map' type-id='type-id-19' visibility='default' filepath='ssl/record/record.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_seq_num' type-id='type-id-253' visibility='default' filepath='ssl/record/record.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='evp_cipher_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-399'/>
    <class-decl name='record_pqueue_st' size-in-bits='64' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='78' column='1' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-73' visibility='default' filepath='ssl/record/record.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='q' type-id='type-id-402' visibility='default' filepath='ssl/record/record.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl3_enc_method' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1953' column='1' id='type-id-397'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enc' type-id='type-id-403' visibility='default' filepath='ssl/ssl_local.h' line='1954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mac' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='1955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setup_key_block' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='1956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='generate_master_secret' type-id='type-id-405' visibility='default' filepath='ssl/ssl_local.h' line='1957' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='change_cipher_state' type-id='type-id-112' visibility='default' filepath='ssl/ssl_local.h' line='1959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='final_finish_mac' type-id='type-id-406' visibility='default' filepath='ssl/ssl_local.h' line='1960' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='client_finished_label' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='1961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='client_finished_label_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1962' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='server_finished_label' type-id='type-id-17' visibility='default' filepath='ssl/ssl_local.h' line='1963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='server_finished_label_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='alert_value' type-id='type-id-407' visibility='default' filepath='ssl/ssl_local.h' line='1965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='export_keying_material' type-id='type-id-408' visibility='default' filepath='ssl/ssl_local.h' line='1966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='enc_flags' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='set_handshake_header' type-id='type-id-409' visibility='default' filepath='ssl/ssl_local.h' line='1973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='close_construct_packet' type-id='type-id-409' visibility='default' filepath='ssl/ssl_local.h' line='1975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='do_write' type-id='type-id-123' visibility='default' filepath='ssl/ssl_local.h' line='1977' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='288' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-383' visibility='default' filepath='ssl/ssl_local.h' line='1844' column='1' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ext_type' type-id='type-id-73' visibility='default' filepath='ssl/ssl_local.h' line='1845' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='role' type-id='type-id-410' visibility='default' filepath='ssl/ssl_local.h' line='1846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='1848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ext_flags' type-id='type-id-33' visibility='default' filepath='ssl/ssl_local.h' line='1853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='add_cb' type-id='type-id-411' visibility='default' filepath='ssl/ssl_local.h' line='1854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='free_cb' type-id='type-id-412' visibility='default' filepath='ssl/ssl_local.h' line='1855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='add_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='parse_cb' type-id='type-id-413' visibility='default' filepath='ssl/ssl_local.h' line='1857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='parse_arg' type-id='type-id-84' visibility='default' filepath='ssl/ssl_local.h' line='1858' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-414' size-in-bits='32' id='type-id-403'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='32' id='type-id-404'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='32' id='type-id-409'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='32' id='type-id-408'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='32' id='type-id-405'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='32' id='type-id-407'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='32' id='type-id-402'/>
    <typedef-decl name='ENDPOINT' type-id='type-id-420' filepath='ssl/ssl_local.h' line='1841' column='1' id='type-id-410'/>
    <typedef-decl name='SSL_custom_ext_add_cb_ex' type-id='type-id-421' filepath='include/openssl/ssl.h' line='284' column='1' id='type-id-411'/>
    <typedef-decl name='SSL_custom_ext_free_cb_ex' type-id='type-id-422' filepath='include/openssl/ssl.h' line='291' column='1' id='type-id-412'/>
    <typedef-decl name='SSL_custom_ext_parse_cb_ex' type-id='type-id-423' filepath='include/openssl/ssl.h' line='296' column='1' id='type-id-413'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='32' id='type-id-406'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='ssl/ssl_local.h' line='1837' column='1' id='type-id-420'>
      <underlying-type type-id='type-id-184'/>
      <enumerator name='ENDPOINT_CLIENT' value='0'/>
      <enumerator name='ENDPOINT_SERVER' value='1'/>
      <enumerator name='ENDPOINT_BOTH' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-425' size-in-bits='32' id='type-id-421'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='32' id='type-id-423'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='32' id='type-id-422'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='32' path='&lt;artificial&gt;-2496b' comp-dir-path='/usr/src/debug/openssl-1_1-1.1.1k-2.12.i386' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='8' id='type-id-428'>
      <subrange length='1' type-id='type-id-4' id='type-id-429'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='320' id='type-id-430'>
      <subrange length='40' type-id='type-id-4' id='type-id-431'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-432'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-433'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-434'/>
    <class-decl name='ossl_init_settings_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-435'/>
    <class-decl name='rsa_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-436'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-437'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-438'/>
    <typedef-decl name='OPENSSL_INIT_SETTINGS' type-id='type-id-435' filepath='include/openssl/ossl_typ.h' line='144' column='1' id='type-id-439'/>
    <typedef-decl name='SSL_CTX_alpn_select_cb_func' type-id='type-id-172' filepath='include/openssl/ssl.h' line='814' column='1' id='type-id-440'/>
    <typedef-decl name='RSA' type-id='type-id-436' filepath='include/openssl/ossl_typ.h' line='112' column='1' id='type-id-441'/>
    <typedef-decl name='FILE' type-id='type-id-442' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-443'/>
    <class-decl name='_IO_FILE' size-in-bits='1184' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-442'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_IO_read_ptr' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_IO_read_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_write_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_IO_write_ptr' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_write_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_IO_buf_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_buf_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_IO_save_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_backup_base' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='_IO_save_end' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_markers' type-id='type-id-444' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='_chain' type-id='type-id-445' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_fileno' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='_flags2' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_old_offset' type-id='type-id-446' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='_cur_column' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='_vtable_offset' type-id='type-id-438' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='568'>
        <var-decl name='_shortbuf' type-id='type-id-428' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_lock' type-id='type-id-447' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='_offset' type-id='type-id-448' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='_codecvt' type-id='type-id-449' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_wide_data' type-id='type-id-450' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='_freeres_list' type-id='type-id-445' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_freeres_buf' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='__pad5' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_mode' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='_unused2' type-id='type-id-430' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-446'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-1' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-451'/>
    <typedef-decl name='__off64_t' type-id='type-id-452' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-448'/>
    <typedef-decl name='__int64_t' type-id='type-id-437' filepath='/usr/include/bits/types.h' line='47' column='1' id='type-id-452'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='32' id='type-id-453'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='32' id='type-id-454'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='32' id='type-id-455'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='32' id='type-id-457'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='32' id='type-id-445'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='32' id='type-id-449'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='32' id='type-id-447'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='32' id='type-id-444'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='32' id='type-id-450'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-458'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='32' id='type-id-459'/>
    <qualified-type-def type-id='type-id-439' const='yes' id='type-id-460'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='32' id='type-id-461'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-462'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='32' id='type-id-463'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-464'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='32' id='type-id-466'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='32' id='type-id-467'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='32' id='type-id-468'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='32' id='type-id-470'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='32' id='type-id-471'/>
    <function-decl name='OPENSSL_init_ssl' mangled-name='OPENSSL_init_ssl' filepath='ssl/ssl_init.c' line='210' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='OPENSSL_init_ssl@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-144' name='opts' filepath='ssl/ssl_init.c' line='210' column='1'/>
      <parameter type-id='type-id-461' name='settings' filepath='ssl/ssl_init.c' line='210' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_is_dtls' mangled-name='SSL_is_dtls' filepath='ssl/ssl_lib.c' line='861' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_is_dtls@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='861' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_up_ref' mangled-name='SSL_up_ref' filepath='ssl/ssl_lib.c' line='866' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_up_ref@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='866' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_session_id_context' mangled-name='SSL_CTX_set_session_id_context' filepath='ssl/ssl_lib.c' line='878' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_session_id_context@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='878' column='1'/>
      <parameter type-id='type-id-44' name='sid_ctx' filepath='ssl/ssl_lib.c' line='878' column='1'/>
      <parameter type-id='type-id-4' name='sid_ctx_len' filepath='ssl/ssl_lib.c' line='879' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_session_id_context' mangled-name='SSL_set_session_id_context' filepath='ssl/ssl_lib.c' line='892' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_session_id_context@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='892' column='1'/>
      <parameter type-id='type-id-44' name='sid_ctx' filepath='ssl/ssl_lib.c' line='892' column='1'/>
      <parameter type-id='type-id-4' name='sid_ctx_len' filepath='ssl/ssl_lib.c' line='893' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_generate_session_id' mangled-name='SSL_CTX_set_generate_session_id' filepath='ssl/ssl_lib.c' line='906' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_generate_session_id@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='906' column='1'/>
      <parameter type-id='type-id-98' name='cb' filepath='ssl/ssl_lib.c' line='906' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_generate_session_id' mangled-name='SSL_set_generate_session_id' filepath='ssl/ssl_lib.c' line='914' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_generate_session_id@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='914' column='1'/>
      <parameter type-id='type-id-98' name='cb' filepath='ssl/ssl_lib.c' line='914' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_has_matching_session_id' mangled-name='SSL_has_matching_session_id' filepath='ssl/ssl_lib.c' line='922' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_has_matching_session_id@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='ssl' filepath='ssl/ssl_lib.c' line='922' column='1'/>
      <parameter type-id='type-id-44' name='id' filepath='ssl/ssl_lib.c' line='922' column='1'/>
      <parameter type-id='type-id-4' name='id_len' filepath='ssl/ssl_lib.c' line='923' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_purpose' mangled-name='SSL_CTX_set_purpose' filepath='ssl/ssl_lib.c' line='947' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_purpose@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='s' filepath='ssl/ssl_lib.c' line='947' column='1'/>
      <parameter type-id='type-id-18' name='purpose' filepath='ssl/ssl_lib.c' line='947' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_purpose' mangled-name='SSL_set_purpose' filepath='ssl/ssl_lib.c' line='952' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_purpose@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='952' column='1'/>
      <parameter type-id='type-id-18' name='purpose' filepath='ssl/ssl_lib.c' line='952' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_trust' mangled-name='SSL_CTX_set_trust' filepath='ssl/ssl_lib.c' line='957' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_trust@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='s' filepath='ssl/ssl_lib.c' line='957' column='1'/>
      <parameter type-id='type-id-18' name='trust' filepath='ssl/ssl_lib.c' line='957' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_trust' mangled-name='SSL_set_trust' filepath='ssl/ssl_lib.c' line='962' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_trust@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='962' column='1'/>
      <parameter type-id='type-id-18' name='trust' filepath='ssl/ssl_lib.c' line='962' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set1_host' mangled-name='SSL_set1_host' filepath='ssl/ssl_lib.c' line='967' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set1_host@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='967' column='1'/>
      <parameter type-id='type-id-17' name='hostname' filepath='ssl/ssl_lib.c' line='967' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_add1_host' mangled-name='SSL_add1_host' filepath='ssl/ssl_lib.c' line='972' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_add1_host@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='972' column='1'/>
      <parameter type-id='type-id-17' name='hostname' filepath='ssl/ssl_lib.c' line='972' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_hostflags' mangled-name='SSL_set_hostflags' filepath='ssl/ssl_lib.c' line='977' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_hostflags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='977' column='1'/>
      <parameter type-id='type-id-4' name='flags' filepath='ssl/ssl_lib.c' line='977' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get0_peername' mangled-name='SSL_get0_peername' filepath='ssl/ssl_lib.c' line='982' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_peername@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='982' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_CTX_dane_enable' mangled-name='SSL_CTX_dane_enable' filepath='ssl/ssl_lib.c' line='987' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_dane_enable@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='987' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_dane_set_flags' mangled-name='SSL_CTX_dane_set_flags' filepath='ssl/ssl_lib.c' line='992' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_dane_set_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='992' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='ssl/ssl_lib.c' line='992' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='SSL_CTX_dane_clear_flags' mangled-name='SSL_CTX_dane_clear_flags' filepath='ssl/ssl_lib.c' line='1000' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_dane_clear_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='1000' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='ssl/ssl_lib.c' line='1000' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='SSL_dane_set_flags' mangled-name='SSL_dane_set_flags' filepath='ssl/ssl_lib.c' line='1051' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_dane_set_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='1051' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='ssl/ssl_lib.c' line='1051' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='SSL_dane_clear_flags' mangled-name='SSL_dane_clear_flags' filepath='ssl/ssl_lib.c' line='1059' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_dane_clear_flags@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='1059' column='1'/>
      <parameter type-id='type-id-19' name='flags' filepath='ssl/ssl_lib.c' line='1059' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='SSL_get0_dane_authority' mangled-name='SSL_get0_dane_authority' filepath='ssl/ssl_lib.c' line='1067' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_dane_authority@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1067' column='1'/>
      <parameter type-id='type-id-472' name='mcert' filepath='ssl/ssl_lib.c' line='1067' column='1'/>
      <parameter type-id='type-id-473' name='mspki' filepath='ssl/ssl_lib.c' line='1067' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get0_dane_tlsa' mangled-name='SSL_get0_dane_tlsa' filepath='ssl/ssl_lib.c' line='1082' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_dane_tlsa@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1082' column='1'/>
      <parameter type-id='type-id-140' name='usage' filepath='ssl/ssl_lib.c' line='1082' column='1'/>
      <parameter type-id='type-id-140' name='selector' filepath='ssl/ssl_lib.c' line='1082' column='1'/>
      <parameter type-id='type-id-140' name='mtype' filepath='ssl/ssl_lib.c' line='1083' column='1'/>
      <parameter type-id='type-id-47' name='data' filepath='ssl/ssl_lib.c' line='1083' column='1'/>
      <parameter type-id='type-id-474' name='dlen' filepath='ssl/ssl_lib.c' line='1083' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get0_dane' mangled-name='SSL_get0_dane' filepath='ssl/ssl_lib.c' line='1104' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_dane@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1104' column='1'/>
      <return type-id='type-id-455'/>
    </function-decl>
    <function-decl name='SSL_dane_tlsa_add' mangled-name='SSL_dane_tlsa_add' filepath='ssl/ssl_lib.c' line='1109' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_dane_tlsa_add@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1109' column='1'/>
      <parameter type-id='type-id-165' name='usage' filepath='ssl/ssl_lib.c' line='1109' column='1'/>
      <parameter type-id='type-id-165' name='selector' filepath='ssl/ssl_lib.c' line='1109' column='1'/>
      <parameter type-id='type-id-165' name='mtype' filepath='ssl/ssl_lib.c' line='1110' column='1'/>
      <parameter type-id='type-id-44' name='data' filepath='ssl/ssl_lib.c' line='1110' column='1'/>
      <parameter type-id='type-id-8' name='dlen' filepath='ssl/ssl_lib.c' line='1110' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_dane_mtype_set' mangled-name='SSL_CTX_dane_mtype_set' filepath='ssl/ssl_lib.c' line='1115' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_dane_mtype_set@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='1115' column='1'/>
      <parameter type-id='type-id-45' name='md' filepath='ssl/ssl_lib.c' line='1115' column='1'/>
      <parameter type-id='type-id-165' name='mtype' filepath='ssl/ssl_lib.c' line='1115' column='1'/>
      <parameter type-id='type-id-165' name='ord' filepath='ssl/ssl_lib.c' line='1116' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set1_param' mangled-name='SSL_CTX_set1_param' filepath='ssl/ssl_lib.c' line='1121' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set1_param@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='1121' column='1'/>
      <parameter type-id='type-id-99' name='vpm' filepath='ssl/ssl_lib.c' line='1121' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set1_param' mangled-name='SSL_set1_param' filepath='ssl/ssl_lib.c' line='1126' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set1_param@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='1126' column='1'/>
      <parameter type-id='type-id-99' name='vpm' filepath='ssl/ssl_lib.c' line='1126' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_get0_param' mangled-name='SSL_CTX_get0_param' filepath='ssl/ssl_lib.c' line='1131' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get0_param@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='1131' column='1'/>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='SSL_get0_param' mangled-name='SSL_get0_param' filepath='ssl/ssl_lib.c' line='1136' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_param@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='1136' column='1'/>
      <return type-id='type-id-99'/>
    </function-decl>
    <function-decl name='SSL_certs_clear' mangled-name='SSL_certs_clear' filepath='ssl/ssl_lib.c' line='1141' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_certs_clear@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1141' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set0_rbio' mangled-name='SSL_set0_rbio' filepath='ssl/ssl_lib.c' line='1242' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set0_rbio@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1242' column='1'/>
      <parameter type-id='type-id-122' name='rbio' filepath='ssl/ssl_lib.c' line='1242' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set0_wbio' mangled-name='SSL_set0_wbio' filepath='ssl/ssl_lib.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set0_wbio@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1248' column='1'/>
      <parameter type-id='type-id-122' name='wbio' filepath='ssl/ssl_lib.c' line='1248' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get_rbio' mangled-name='SSL_get_rbio' filepath='ssl/ssl_lib.c' line='1304' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_rbio@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1304' column='1'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <function-decl name='SSL_get_wbio' mangled-name='SSL_get_wbio' filepath='ssl/ssl_lib.c' line='1309' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_wbio@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1309' column='1'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <function-decl name='SSL_set_bio' mangled-name='SSL_set_bio' filepath='ssl/ssl_lib.c' line='1264' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_bio@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1264' column='1'/>
      <parameter type-id='type-id-122' name='rbio' filepath='ssl/ssl_lib.c' line='1264' column='1'/>
      <parameter type-id='type-id-122' name='wbio' filepath='ssl/ssl_lib.c' line='1264' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get_rfd' mangled-name='SSL_get_rfd' filepath='ssl/ssl_lib.c' line='1326' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_rfd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1326' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_fd' mangled-name='SSL_get_fd' filepath='ssl/ssl_lib.c' line='1321' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_fd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1321' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_wfd' mangled-name='SSL_get_wfd' filepath='ssl/ssl_lib.c' line='1338' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_wfd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1338' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_fd' mangled-name='SSL_set_fd' filepath='ssl/ssl_lib.c' line='1351' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_fd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1351' column='1'/>
      <parameter type-id='type-id-18' name='fd' filepath='ssl/ssl_lib.c' line='1351' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_wfd' mangled-name='SSL_set_wfd' filepath='ssl/ssl_lib.c' line='1369' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_wfd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1369' column='1'/>
      <parameter type-id='type-id-18' name='fd' filepath='ssl/ssl_lib.c' line='1369' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_rfd' mangled-name='SSL_set_rfd' filepath='ssl/ssl_lib.c' line='1390' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_rfd@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1390' column='1'/>
      <parameter type-id='type-id-18' name='fd' filepath='ssl/ssl_lib.c' line='1390' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_finished' mangled-name='SSL_get_finished' filepath='ssl/ssl_lib.c' line='1414' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_finished@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1414' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1414' column='1'/>
      <parameter type-id='type-id-8' name='count' filepath='ssl/ssl_lib.c' line='1414' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='SSL_get_peer_finished' mangled-name='SSL_get_peer_finished' filepath='ssl/ssl_lib.c' line='1428' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_peer_finished@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1428' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1428' column='1'/>
      <parameter type-id='type-id-8' name='count' filepath='ssl/ssl_lib.c' line='1428' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='SSL_get_verify_mode' mangled-name='SSL_get_verify_mode' filepath='ssl/ssl_lib.c' line='1441' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_verify_mode@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1441' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_verify_depth' mangled-name='SSL_get_verify_depth' filepath='ssl/ssl_lib.c' line='1446' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_verify_depth@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1446' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_verify_callback' mangled-name='SSL_get_verify_callback' filepath='ssl/ssl_lib.c' line='1451' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_verify_callback@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1451' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_verify_mode' mangled-name='SSL_CTX_get_verify_mode' filepath='ssl/ssl_lib.c' line='1455' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_verify_mode@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='1455' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_verify_depth' mangled-name='SSL_CTX_get_verify_depth' filepath='ssl/ssl_lib.c' line='1460' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_verify_depth@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='1460' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_verify_callback' mangled-name='SSL_CTX_get_verify_callback' filepath='ssl/ssl_lib.c' line='1465' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_verify_callback@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='1465' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='SSL_set_verify' mangled-name='SSL_set_verify' filepath='ssl/ssl_lib.c' line='1469' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_verify@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1469' column='1'/>
      <parameter type-id='type-id-18' name='mode' filepath='ssl/ssl_lib.c' line='1469' column='1'/>
      <parameter type-id='type-id-97' name='callback' filepath='ssl/ssl_lib.c' line='1470' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set_verify_depth' mangled-name='SSL_set_verify_depth' filepath='ssl/ssl_lib.c' line='1477' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_verify_depth@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1477' column='1'/>
      <parameter type-id='type-id-18' name='depth' filepath='ssl/ssl_lib.c' line='1477' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set_read_ahead' mangled-name='SSL_set_read_ahead' filepath='ssl/ssl_lib.c' line='1482' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_read_ahead@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1482' column='1'/>
      <parameter type-id='type-id-18' name='yes' filepath='ssl/ssl_lib.c' line='1482' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get_read_ahead' mangled-name='SSL_get_read_ahead' filepath='ssl/ssl_lib.c' line='1487' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_read_ahead@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1487' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_pending' mangled-name='SSL_pending' filepath='ssl/ssl_lib.c' line='1492' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_pending@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1492' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_has_pending' mangled-name='SSL_has_pending' filepath='ssl/ssl_lib.c' line='1509' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_has_pending@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1509' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_peer_certificate' mangled-name='SSL_get_peer_certificate' filepath='ssl/ssl_lib.c' line='1525' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_peer_certificate@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1525' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='SSL_get_peer_cert_chain' mangled-name='SSL_get_peer_cert_chain' filepath='ssl/ssl_lib.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_peer_cert_chain@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1542' column='1'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='SSL_CTX_check_private_key' mangled-name='SSL_CTX_check_private_key' filepath='ssl/ssl_lib.c' line='1592' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_check_private_key@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='1592' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_check_private_key' mangled-name='SSL_check_private_key' filepath='ssl/ssl_lib.c' line='1607' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_check_private_key@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='ssl' filepath='ssl/ssl_lib.c' line='1607' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_waiting_for_async' mangled-name='SSL_waiting_for_async' filepath='ssl/ssl_lib.c' line='1625' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_waiting_for_async@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1625' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_all_async_fds' mangled-name='SSL_get_all_async_fds' filepath='ssl/ssl_lib.c' line='1633' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_all_async_fds@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1633' column='1'/>
      <parameter type-id='type-id-12' name='fds' filepath='ssl/ssl_lib.c' line='1633' column='1'/>
      <parameter type-id='type-id-474' name='numfds' filepath='ssl/ssl_lib.c' line='1633' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_changed_async_fds' mangled-name='SSL_get_changed_async_fds' filepath='ssl/ssl_lib.c' line='1642' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_changed_async_fds@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1642' column='1'/>
      <parameter type-id='type-id-12' name='addfd' filepath='ssl/ssl_lib.c' line='1642' column='1'/>
      <parameter type-id='type-id-474' name='numaddfds' filepath='ssl/ssl_lib.c' line='1642' column='1'/>
      <parameter type-id='type-id-12' name='delfd' filepath='ssl/ssl_lib.c' line='1643' column='1'/>
      <parameter type-id='type-id-474' name='numdelfds' filepath='ssl/ssl_lib.c' line='1643' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_default_timeout' mangled-name='SSL_get_default_timeout' filepath='ssl/ssl_lib.c' line='1673' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_default_timeout@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1673' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='SSL_read' mangled-name='SSL_read' filepath='ssl/ssl_lib.c' line='1773' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_read@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1773' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1773' column='1'/>
      <parameter type-id='type-id-18' name='num' filepath='ssl/ssl_lib.c' line='1773' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_read_ex' mangled-name='SSL_read_ex' filepath='ssl/ssl_lib.c' line='1795' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_read_ex@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1795' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1795' column='1'/>
      <parameter type-id='type-id-8' name='num' filepath='ssl/ssl_lib.c' line='1795' column='1'/>
      <parameter type-id='type-id-474' name='readbytes' filepath='ssl/ssl_lib.c' line='1795' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_early_data_status' mangled-name='SSL_get_early_data_status' filepath='ssl/ssl_lib.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_early_data_status@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='1859' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_peek' mangled-name='SSL_peek' filepath='ssl/ssl_lib.c' line='1892' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_peek@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1892' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1892' column='1'/>
      <parameter type-id='type-id-18' name='num' filepath='ssl/ssl_lib.c' line='1892' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_peek_ex' mangled-name='SSL_peek_ex' filepath='ssl/ssl_lib.c' line='1915' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_peek_ex@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1915' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1915' column='1'/>
      <parameter type-id='type-id-8' name='num' filepath='ssl/ssl_lib.c' line='1915' column='1'/>
      <parameter type-id='type-id-474' name='readbytes' filepath='ssl/ssl_lib.c' line='1915' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_write' mangled-name='SSL_write' filepath='ssl/ssl_lib.c' line='1964' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_write@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1964' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1964' column='1'/>
      <parameter type-id='type-id-18' name='num' filepath='ssl/ssl_lib.c' line='1964' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_write_ex' mangled-name='SSL_write_ex' filepath='ssl/ssl_lib.c' line='1986' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_write_ex@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='1986' column='1'/>
      <parameter type-id='type-id-84' name='buf' filepath='ssl/ssl_lib.c' line='1986' column='1'/>
      <parameter type-id='type-id-8' name='num' filepath='ssl/ssl_lib.c' line='1986' column='1'/>
      <parameter type-id='type-id-474' name='written' filepath='ssl/ssl_lib.c' line='1986' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_key_update_type' mangled-name='SSL_get_key_update_type' filepath='ssl/ssl_lib.c' line='2127' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_key_update_type@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2127' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_renegotiate' mangled-name='SSL_renegotiate' filepath='ssl/ssl_lib.c' line='2132' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_renegotiate@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2132' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_renegotiate_abbreviated' mangled-name='SSL_renegotiate_abbreviated' filepath='ssl/ssl_lib.c' line='2150' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_renegotiate_abbreviated@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2150' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_renegotiate_pending' mangled-name='SSL_renegotiate_pending' filepath='ssl/ssl_lib.c' line='2168' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_renegotiate_pending@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2168' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_callback_ctrl' mangled-name='SSL_callback_ctrl' filepath='ssl/ssl_lib.c' line='2267' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_callback_ctrl@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2267' column='1'/>
      <parameter type-id='type-id-18' name='cmd' filepath='ssl/ssl_lib.c' line='2267' column='1'/>
      <parameter type-id='type-id-475' name='fp' filepath='ssl/ssl_lib.c' line='2267' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='SSL_CTX_sessions' mangled-name='SSL_CTX_sessions' filepath='ssl/ssl_lib.c' line='2282' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_sessions@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2282' column='1'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='SSL_CTX_ctrl' mangled-name='SSL_CTX_ctrl' filepath='ssl/ssl_lib.c' line='2287' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_ctrl@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2287' column='1'/>
      <parameter type-id='type-id-18' name='cmd' filepath='ssl/ssl_lib.c' line='2287' column='1'/>
      <parameter type-id='type-id-48' name='larg' filepath='ssl/ssl_lib.c' line='2287' column='1'/>
      <parameter type-id='type-id-84' name='parg' filepath='ssl/ssl_lib.c' line='2287' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='SSL_CTX_callback_ctrl' mangled-name='SSL_CTX_callback_ctrl' filepath='ssl/ssl_lib.c' line='2407' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_callback_ctrl@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2407' column='1'/>
      <parameter type-id='type-id-18' name='cmd' filepath='ssl/ssl_lib.c' line='2407' column='1'/>
      <parameter type-id='type-id-475' name='fp' filepath='ssl/ssl_lib.c' line='2407' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='SSL_get_ciphers' mangled-name='SSL_get_ciphers' filepath='ssl/ssl_lib.c' line='2443' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_ciphers@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2443' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='SSL_get_client_ciphers' mangled-name='SSL_get_client_ciphers' filepath='ssl/ssl_lib.c' line='2455' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_client_ciphers@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2455' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='SSL_get1_supported_ciphers' mangled-name='SSL_get1_supported_ciphers' filepath='ssl/ssl_lib.c' line='2462' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get1_supported_ciphers@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2462' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='SSL_get_cipher_list' mangled-name='SSL_get_cipher_list' filepath='ssl/ssl_lib.c' line='2503' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_cipher_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2503' column='1'/>
      <parameter type-id='type-id-18' name='n' filepath='ssl/ssl_lib.c' line='2503' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_ciphers' mangled-name='SSL_CTX_get_ciphers' filepath='ssl/ssl_lib.c' line='2521' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_ciphers@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='2521' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_cipher_list' mangled-name='SSL_CTX_set_cipher_list' filepath='ssl/ssl_lib.c' line='2549' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_cipher_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2549' column='1'/>
      <parameter type-id='type-id-17' name='str' filepath='ssl/ssl_lib.c' line='2549' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_cipher_list' mangled-name='SSL_set_cipher_list' filepath='ssl/ssl_lib.c' line='2573' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_cipher_list@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2573' column='1'/>
      <parameter type-id='type-id-17' name='str' filepath='ssl/ssl_lib.c' line='2573' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get_shared_ciphers' mangled-name='SSL_get_shared_ciphers' filepath='ssl/ssl_lib.c' line='2590' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_shared_ciphers@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2590' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='ssl/ssl_lib.c' line='2590' column='1'/>
      <parameter type-id='type-id-18' name='size' filepath='ssl/ssl_lib.c' line='2590' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_select_next_proto' mangled-name='SSL_select_next_proto' filepath='ssl/ssl_lib.c' line='2737' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_select_next_proto@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-35' name='out' filepath='ssl/ssl_lib.c' line='2737' column='1'/>
      <parameter type-id='type-id-65' name='outlen' filepath='ssl/ssl_lib.c' line='2737' column='1'/>
      <parameter type-id='type-id-44' name='server' filepath='ssl/ssl_lib.c' line='2738' column='1'/>
      <parameter type-id='type-id-4' name='server_len' filepath='ssl/ssl_lib.c' line='2739' column='1'/>
      <parameter type-id='type-id-44' name='client' filepath='ssl/ssl_lib.c' line='2740' column='1'/>
      <parameter type-id='type-id-4' name='client_len' filepath='ssl/ssl_lib.c' line='2740' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_get0_next_proto_negotiated' mangled-name='SSL_get0_next_proto_negotiated' filepath='ssl/ssl_lib.c' line='2784' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_next_proto_negotiated@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='2784' column='1'/>
      <parameter type-id='type-id-47' name='data' filepath='ssl/ssl_lib.c' line='2784' column='1'/>
      <parameter type-id='type-id-476' name='len' filepath='ssl/ssl_lib.c' line='2785' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_next_protos_advertised_cb' mangled-name='SSL_CTX_set_next_protos_advertised_cb' filepath='ssl/ssl_lib.c' line='2805' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_next_protos_advertised_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2805' column='1'/>
      <parameter type-id='type-id-173' name='cb' filepath='ssl/ssl_lib.c' line='2806' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='2807' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_next_proto_select_cb' mangled-name='SSL_CTX_set_next_proto_select_cb' filepath='ssl/ssl_lib.c' line='2823' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_next_proto_select_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2823' column='1'/>
      <parameter type-id='type-id-174' name='cb' filepath='ssl/ssl_lib.c' line='2824' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='2825' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_alpn_protos' mangled-name='SSL_CTX_set_alpn_protos' filepath='ssl/ssl_lib.c' line='2837' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_alpn_protos@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2837' column='1'/>
      <parameter type-id='type-id-44' name='protos' filepath='ssl/ssl_lib.c' line='2837' column='1'/>
      <parameter type-id='type-id-4' name='protos_len' filepath='ssl/ssl_lib.c' line='2838' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_alpn_protos' mangled-name='SSL_set_alpn_protos' filepath='ssl/ssl_lib.c' line='2857' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_alpn_protos@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='ssl' filepath='ssl/ssl_lib.c' line='2857' column='1'/>
      <parameter type-id='type-id-44' name='protos' filepath='ssl/ssl_lib.c' line='2857' column='1'/>
      <parameter type-id='type-id-4' name='protos_len' filepath='ssl/ssl_lib.c' line='2858' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_alpn_select_cb' mangled-name='SSL_CTX_set_alpn_select_cb' filepath='ssl/ssl_lib.c' line='2877' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_alpn_select_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='2877' column='1'/>
      <parameter type-id='type-id-440' name='cb' filepath='ssl/ssl_lib.c' line='2878' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='2879' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get0_alpn_selected' mangled-name='SSL_get0_alpn_selected' filepath='ssl/ssl_lib.c' line='2891' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get0_alpn_selected@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='ssl' filepath='ssl/ssl_lib.c' line='2891' column='1'/>
      <parameter type-id='type-id-47' name='data' filepath='ssl/ssl_lib.c' line='2891' column='1'/>
      <parameter type-id='type-id-476' name='len' filepath='ssl/ssl_lib.c' line='2892' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_export_keying_material' mangled-name='SSL_export_keying_material' filepath='ssl/ssl_lib.c' line='2903' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_export_keying_material@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='2903' column='1'/>
      <parameter type-id='type-id-65' name='out' filepath='ssl/ssl_lib.c' line='2903' column='1'/>
      <parameter type-id='type-id-8' name='olen' filepath='ssl/ssl_lib.c' line='2903' column='1'/>
      <parameter type-id='type-id-17' name='label' filepath='ssl/ssl_lib.c' line='2904' column='1'/>
      <parameter type-id='type-id-8' name='llen' filepath='ssl/ssl_lib.c' line='2904' column='1'/>
      <parameter type-id='type-id-44' name='context' filepath='ssl/ssl_lib.c' line='2905' column='1'/>
      <parameter type-id='type-id-8' name='contextlen' filepath='ssl/ssl_lib.c' line='2905' column='1'/>
      <parameter type-id='type-id-18' name='use_context' filepath='ssl/ssl_lib.c' line='2906' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_up_ref' mangled-name='SSL_CTX_up_ref' filepath='ssl/ssl_lib.c' line='3170' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_up_ref@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3170' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_default_passwd_cb' mangled-name='SSL_CTX_set_default_passwd_cb' filepath='ssl/ssl_lib.c' line='3246' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_default_passwd_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3246' column='1'/>
      <parameter type-id='type-id-85' name='cb' filepath='ssl/ssl_lib.c' line='3246' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_default_passwd_cb_userdata' mangled-name='SSL_CTX_set_default_passwd_cb_userdata' filepath='ssl/ssl_lib.c' line='3251' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_default_passwd_cb_userdata@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3251' column='1'/>
      <parameter type-id='type-id-84' name='u' filepath='ssl/ssl_lib.c' line='3251' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_default_passwd_cb' mangled-name='SSL_CTX_get_default_passwd_cb' filepath='ssl/ssl_lib.c' line='3256' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_default_passwd_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3256' column='1'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_default_passwd_cb_userdata' mangled-name='SSL_CTX_get_default_passwd_cb_userdata' filepath='ssl/ssl_lib.c' line='3261' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_default_passwd_cb_userdata@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3261' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='SSL_set_default_passwd_cb' mangled-name='SSL_set_default_passwd_cb' filepath='ssl/ssl_lib.c' line='3266' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_default_passwd_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3266' column='1'/>
      <parameter type-id='type-id-85' name='cb' filepath='ssl/ssl_lib.c' line='3266' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set_default_passwd_cb_userdata' mangled-name='SSL_set_default_passwd_cb_userdata' filepath='ssl/ssl_lib.c' line='3271' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_default_passwd_cb_userdata@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3271' column='1'/>
      <parameter type-id='type-id-84' name='u' filepath='ssl/ssl_lib.c' line='3271' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get_default_passwd_cb' mangled-name='SSL_get_default_passwd_cb' filepath='ssl/ssl_lib.c' line='3276' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_default_passwd_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3276' column='1'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='SSL_get_default_passwd_cb_userdata' mangled-name='SSL_get_default_passwd_cb_userdata' filepath='ssl/ssl_lib.c' line='3281' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_default_passwd_cb_userdata@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3281' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_cert_verify_callback' mangled-name='SSL_CTX_set_cert_verify_callback' filepath='ssl/ssl_lib.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_cert_verify_callback@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3286' column='1'/>
      <parameter type-id='type-id-83' name='cb' filepath='ssl/ssl_lib.c' line='3287' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='3288' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_verify' mangled-name='SSL_CTX_set_verify' filepath='ssl/ssl_lib.c' line='3294' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_verify@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3294' column='1'/>
      <parameter type-id='type-id-18' name='mode' filepath='ssl/ssl_lib.c' line='3294' column='1'/>
      <parameter type-id='type-id-97' name='cb' filepath='ssl/ssl_lib.c' line='3295' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_verify_depth' mangled-name='SSL_CTX_set_verify_depth' filepath='ssl/ssl_lib.c' line='3301' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_verify_depth@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='ctx' filepath='ssl/ssl_lib.c' line='3301' column='1'/>
      <parameter type-id='type-id-18' name='depth' filepath='ssl/ssl_lib.c' line='3301' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_cert_cb' mangled-name='SSL_CTX_set_cert_cb' filepath='ssl/ssl_lib.c' line='3306' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_cert_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-9' name='c' filepath='ssl/ssl_lib.c' line='3306' column='1'/>
      <parameter type-id='type-id-170' name='cb' filepath='ssl/ssl_lib.c' line='3306' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='3306' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set_cert_cb' mangled-name='SSL_set_cert_cb' filepath='ssl/ssl_lib.c' line='3311' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_cert_cb@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3311' column='1'/>
      <parameter type-id='type-id-170' name='cb' filepath='ssl/ssl_lib.c' line='3311' column='1'/>
      <parameter type-id='type-id-84' name='arg' filepath='ssl/ssl_lib.c' line='3311' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_CTX_get_ssl_method' mangled-name='SSL_CTX_get_ssl_method' filepath='ssl/ssl_lib.c' line='3533' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get_ssl_method@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='3533' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='SSL_get_ssl_method' mangled-name='SSL_get_ssl_method' filepath='ssl/ssl_lib.c' line='3538' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_ssl_method@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3538' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='SSL_set_ssl_method' mangled-name='SSL_set_ssl_method' filepath='ssl/ssl_lib.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_ssl_method@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3543' column='1'/>
      <parameter type-id='type-id-74' name='meth' filepath='ssl/ssl_lib.c' line='3543' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='SSL_set_accept_state' mangled-name='SSL_set_accept_state' filepath='ssl/ssl_lib.c' line='3687' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_accept_state@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3687' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_set_connect_state' mangled-name='SSL_set_connect_state' filepath='ssl/ssl_lib.c' line='3696' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_set_connect_state@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-10' name='s' filepath='ssl/ssl_lib.c' line='3696' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='SSL_get_version' mangled-name='SSL_get_version' filepath='ssl/ssl_lib.c' line='3762' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_version@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3762' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='SSL_get_certificate' mangled-name='SSL_get_certificate' filepath='ssl/ssl_lib.c' line='3919' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_certificate@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3919' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='SSL_get_privatekey' mangled-name='SSL_get_privatekey' filepath='ssl/ssl_lib.c' line='3927' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_privatekey@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3927' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='SSL_CTX_get0_certificate' mangled-name='SSL_CTX_get0_certificate' filepath='ssl/ssl_lib.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get0_certificate@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='3935' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='SSL_CTX_get0_privatekey' mangled-name='SSL_CTX_get0_privatekey' filepath='ssl/ssl_lib.c' line='3943' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_get0_privatekey@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-36' name='ctx' filepath='ssl/ssl_lib.c' line='3943' column='1'/>
      <return type-id='type-id-229'/>
    </function-decl>
    <function-decl name='SSL_get_current_cipher' mangled-name='SSL_get_current_cipher' filepath='ssl/ssl_lib.c' line='3951' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_current_cipher@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3951' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='SSL_get_pending_cipher' mangled-name='SSL_get_pending_cipher' filepath='ssl/ssl_lib.c' line='3958' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_pending_cipher@@OPENSSL_1_1_1'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3958' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='SSL_get_current_compression' mangled-name='SSL_get_current_compression' filepath='ssl/ssl_lib.c' line='3963' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_current_compression@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3963' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='SSL_get_current_expansion' mangled-name='SSL_get_current_expansion' filepath='ssl/ssl_lib.c' line='3972' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_get_current_expansion@@OPENSSL_1_1_0'>
      <parameter type-id='type-id-37' name='s' filepath='ssl/ssl_lib.c' line='3972' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='SSL_CTX_set_quiet_shutdown' mangled-name='SSL_CTX_set_quiet_shutdown' filepath='ssl/ssl_lib.c' line='4015' column='1' visibility='default' binding='global' size-in-bits='32' elf-symbol-id='SSL_CTX_set_quiet_shutdown@@OPENSSL_1_1_0'>
